model/README.org
#+STARTUP: showeverything
#+PROPERTY: header-args:Turtle :tangle model.ttl
#+OPTIONS: ':nil *:t -:t ::t <:t H:5 \n:nil ^:{} arch:headline author:t broken-links:nil
#+OPTIONS: c:nil creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t timestamp:nil title:t toc:5
#+OPTIONS: todo:t |:t
#+TITLE: BigDataGrapes Semantic Model
#+DATE: <2019-01-14>
#+AUTHOR: Vladimir Alexiev
#+EMAIL: vladimir.alexiev@ontotext.com
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 25.3.1 (Org mode 9.1.13)

* Intro
We develop the BigDataGrapes Semantic Model by way of example, starting from AUA Table Grapes tabular data.
After this example is approved, we'll follow similar modeling for other kinds of observations.
- We work with [[https://docs.google.com/document/d/1_id0r5pEH-VgQXZnXBN9C5-7SJn-q0J3uM3JHUzl8LU/edit][AUA Table Grapes Data]]
- The data is in [[https://drive.google.com/drive/folders/16p63tgyPaR7BRiOY-_D1T983y2yfr4X4][WP8/Table Grapes Pilot- AUA/Data]], in particular we work with the Fasoulis estate, Geotrisi plot (sub-estate)
- Look in [[https://docs.google.com/document/d/19-6qKtuDx7EoZBNbjmDBqFdToq1mCvEyLtA5xKinO7I/edit][D8.1 Piloting Plan: BigDataGrapes_Piloting Plan-AUA]] for descriptions of equipment and measured indicators
- We're trying to convert to W3C ontologies [[https://docs.google.com/document/d/1f5wJljke0J7ztM3YioyRhKPLbAKwKoq4ipDBaS6Z28I/edit#heading=h.uqcdo9n3ri9l][as described here]]: SOSA, SSN, QB, QB4ST, EO QB; SKOS, QUDT.

** TODO Units of Measure Ontologies
Which ontology should we use to represent Units of Measure (UoM)?
See two survey papers in gdoc UoM.

*** QUDT
For the time being we use QUDT 2.0, which is sponsored by NASA and has an extensive set of 80 ontologies covering Units of Measure, Quantity Kinds, Dimensions and Types.

QUDT semantics is based on dimensional analysis expressed in OWL, which relates each unit to a system of base units using numeric factors and a vector of exponents defined over a set of fundamental dimensions.
This is expressed as attributes ~qudt:dimensionExponentFor~ in class ~qudt:QuantityDimensionVector~, where ~*~ is one of ~AmountOfSubstance, ElectricCurrent, Length, LuminousIntensity, Mass, ThermodynamicTemperature, Time~, and ~qudt:dimensionlessExponent~.
- Each ~qudt:QuantityKind~ is also linked to a respective ~qudt:hasReferenceQuantityKind~: the fundamental unit for that dimension vector.
- Each unit has ~qudt:conversionMultiplier~ to its respective fundamental unit, allowing precise unit conversions if needed.
- There is also ~qudt:conversionOffset~ to allow for units with different scale origin (like Kelvin vs Fahrenheit vs Celsius)
Resources:
- [[http://www.qudt.org/pages/QUDToverviewPage.html][QUDT Overview]]
- [[http://www.qudt.org/release2/qudt-catalog.html][QUDT Catalog]]. We have downloaded the following ontologies that may be relevant to BDG:
  - SCHEMA_QUDT-DATATYPES-v2.0.ttl: not used
  - SCHEMA_QUDT-SCIENCE-v2.0.ttl: eg ~qudt:ConductanceUnit~
  - SCHEMA_QUDT-v2.0.ttl: base ontology
  - VOCAB_QUDT-UNITS-BASE-v2.0.ttl: eg ~unit:Milli~
  - VOCAB_QUDT-UNITS-ELECTROMAGNETISM-v2.0.ttl: eg ~unit:S-PER-M~ "Siemens per meter"
  - VOCAB_QUDT-UNITS-SPACE-AND-TIME-v2.0.ttl
There is a number of ontologies that are in progress or in QA and not yet available for download. Amongst those, the following may be relevant
- http://qudt.org/2.0/schema/qudt/engineering
- http://qudt.org/2.0/vocab/quantitykind/telebiometrics
- http://qudt.org/2.0/vocab/quantitykind/lifesciences
Resolvability:
- Ontology URLs (eg http://qudt.org/schema/qudt) resolve but return only RDF/XML (the HTML version of that ontology is http://qudt.org/doc/2017/DOC_SCHEMA-QUDT-v2.0.html)
- Individual terms (eg http://qudt.org/schema/qudt/GlossaryTerm) don't resolve.

** Property Sources

*** TODO Agricultural Properties
- NIR, RE, RED; NDVI, NDRE, LAI
- Soil electrical conductivity

I've looked previously for NDVI and couldn't find a satisfactory definition (independent of crop type).

