model/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>BigDataGrapes Semantic Model</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Vladimir Alexiev" />
</head>
<body>
<div id="content">
<h1 class="title">BigDataGrapes Semantic Model</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb3696fb">1. Intro</a>
<ul>
<li><a href="#org8262262">1.1. <span class="todo TODO">TODO</span> Units of Measure Ontologies</a>
<ul>
<li><a href="#orgd96d1c6">1.1.1. QUDT</a></li>
</ul>
</li>
<li><a href="#org71dd2d9">1.2. Property Sources</a>
<ul>
<li><a href="#orgc6178f6">1.2.1. <span class="todo TODO">TODO</span> Agricultural Properties</a></li>
<li><a href="#org7b60983">1.2.2. <span class="todo TODO">TODO</span> Statistical Operations</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8fa113c">2. Data Mapping</a>
<ul>
<li><a href="#org56d8018">2.1. Properties/Variables</a>
<ul>
<li><a href="#org4681c03">2.1.1. Geospatial and Temporal Reference</a>
<ul>
<li><a href="#orgfc47d64">2.1.1.1. Position</a></li>
</ul>
</li>
<li><a href="#org32ac258">2.1.2. Position Qualifiers</a></li>
<li><a href="#org85e4d5f">2.1.3. Features of Interest</a>
<ul>
<li><a href="#org603860c">2.1.3.1. Measurement Contexts</a></li>
</ul>
</li>
<li><a href="#orga436f1e">2.1.4. Observable Properties</a>
<ul>
<li><a href="#org9097266">2.1.4.1. Soil Conductivity</a></li>
<li><a href="#org686dd52">2.1.4.2. Canopy Characteristics</a></li>
<li><a href="#orgb5dafee">2.1.4.3. Derived Vegetation Indices</a></li>
<li><a href="#org4a8b288">2.1.4.4. Statistical Summaries of Vegetation Indices</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org8f48586">2.2. Devices/Sensors</a></li>
<li><a href="#org5447eee">2.3. Plots/Geometries</a></li>
<li><a href="#org5b3d0a4">2.4. Data Structure Definition</a></li>
<li><a href="#org5b08ddb">2.5. Datasets</a></li>
<li><a href="#orgf2a4b28">2.6. Observations</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgb3696fb" class="outline-2">
<h2 id="orgb3696fb"><span class="section-number-2">1</span> Intro</h2>
<div class="outline-text-2" id="text-1">
<p>
We develop the BigDataGrapes Semantic Model by way of example, starting from AUA Table Grapes tabular data.
After this example is approved, we'll follow similar modeling for other kinds of observations.
</p>
<ul class="org-ul">
<li>We work with <a href="https://docs.google.com/document/d/1_id0r5pEH-VgQXZnXBN9C5-7SJn-q0J3uM3JHUzl8LU/edit">AUA Table Grapes Data</a></li>
<li>The data is in <a href="https://drive.google.com/drive/folders/16p63tgyPaR7BRiOY-_D1T983y2yfr4X4">WP8/Table Grapes Pilot- AUA/Data</a>, in particular we work with the Fasoulis estate, Geotrisi plot (sub-estate)</li>
<li>Look in <a href="https://docs.google.com/document/d/19-6qKtuDx7EoZBNbjmDBqFdToq1mCvEyLtA5xKinO7I/edit">D8.1 Piloting Plan: BigDataGrapes_Piloting Plan-AUA</a> for descriptions of equipment and measured indicators</li>
<li>We're trying to convert to W3C ontologies <a href="https://docs.google.com/document/d/1f5wJljke0J7ztM3YioyRhKPLbAKwKoq4ipDBaS6Z28I/edit#heading=h.uqcdo9n3ri9l">as described here</a>: SOSA, SSN, QB, QB4ST, EO QB; SKOS, QUDT.</li>
</ul>
</div>

<div id="outline-container-org8262262" class="outline-3">
<h3 id="org8262262"><span class="section-number-3">1.1</span> <span class="todo TODO">TODO</span> Units of Measure Ontologies</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Which ontology should we use to represent Units of Measure (UoM)?
See two survey papers in gdoc UoM.
</p>
</div>

<div id="outline-container-orgd96d1c6" class="outline-4">
<h4 id="orgd96d1c6"><span class="section-number-4">1.1.1</span> QUDT</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
For the time being we use QUDT 2.0, which is sponsored by NASA and has an extensive set of 80 ontologies covering Units of Measure, Quantity Kinds, Dimensions and Types.
</p>

<p>
QUDT semantics is based on dimensional analysis expressed in OWL, which relates each unit to a system of base units using numeric factors and a vector of exponents defined over a set of fundamental dimensions.
This is expressed as attributes <code>qudt:dimensionExponentFor</code> in class <code>qudt:QuantityDimensionVector</code>, where <code>*</code> is one of <code>AmountOfSubstance, ElectricCurrent, Length, LuminousIntensity, Mass, ThermodynamicTemperature, Time</code>, and <code>qudt:dimensionlessExponent</code>.
</p>
<ul class="org-ul">
<li>Each <code>qudt:QuantityKind</code> is also linked to a respective <code>qudt:hasReferenceQuantityKind</code>: the fundamental unit for that dimension vector.</li>
<li>Each unit has <code>qudt:conversionMultiplier</code> to its respective fundamental unit, allowing precise unit conversions if needed.</li>
<li>There is also <code>qudt:conversionOffset</code> to allow for units with different scale origin (like Kelvin vs Fahrenheit vs Celsius)</li>
</ul>
<p>
Resources:
</p>
<ul class="org-ul">
<li><a href="http://www.qudt.org/pages/QUDToverviewPage.html">QUDT Overview</a></li>
<li><a href="http://www.qudt.org/release2/qudt-catalog.html">QUDT Catalog</a>. We have downloaded the following ontologies that may be relevant to BDG:
<ul class="org-ul">
<li>SCHEMA_QUDT-DATATYPES-v2.0.ttl: not used</li>
<li>SCHEMA_QUDT-SCIENCE-v2.0.ttl: eg <code>qudt:ConductanceUnit</code></li>
<li>SCHEMA_QUDT-v2.0.ttl: base ontology</li>
<li>VOCAB_QUDT-UNITS-BASE-v2.0.ttl: eg <code>unit:Milli</code></li>
<li>VOCAB_QUDT-UNITS-ELECTROMAGNETISM-v2.0.ttl: eg <code>unit:S-PER-M</code> "Siemens per meter"</li>
<li>VOCAB_QUDT-UNITS-SPACE-AND-TIME-v2.0.ttl</li>
</ul></li>
</ul>
<p>
There is a number of ontologies that are in progress or in QA and not yet available for download. Amongst those, the following may be relevant
</p>
<ul class="org-ul">
<li><a href="http://qudt.org/2.0/schema/qudt/engineering">http://qudt.org/2.0/schema/qudt/engineering</a></li>
<li><a href="http://qudt.org/2.0/vocab/quantitykind/telebiometrics">http://qudt.org/2.0/vocab/quantitykind/telebiometrics</a></li>
<li><a href="http://qudt.org/2.0/vocab/quantitykind/lifesciences">http://qudt.org/2.0/vocab/quantitykind/lifesciences</a></li>
</ul>
<p>
Resolvability:
</p>
<ul class="org-ul">
<li>Ontology URLs (eg <a href="http://qudt.org/schema/qudt">http://qudt.org/schema/qudt</a>) resolve but return only RDF/XML (the HTML version of that ontology is <a href="http://qudt.org/doc/2017/DOC_SCHEMA-QUDT-v2.0.html">http://qudt.org/doc/2017/DOC_SCHEMA-QUDT-v2.0.html</a>)</li>
<li>Individual terms (eg <a href="http://qudt.org/schema/qudt/GlossaryTerm">http://qudt.org/schema/qudt/GlossaryTerm</a>) don't resolve.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org71dd2d9" class="outline-3">
<h3 id="org71dd2d9"><span class="section-number-3">1.2</span> Property Sources</h3>
<div class="outline-text-3" id="text-1-2">
</div>
<div id="outline-container-orgc6178f6" class="outline-4">
<h4 id="orgc6178f6"><span class="section-number-4">1.2.1</span> <span class="todo TODO">TODO</span> Agricultural Properties</h4>
<div class="outline-text-4" id="text-1-2-1">
<ul class="org-ul">
<li>NIR, RE, RED; NDVI, NDRE, LAI</li>
<li>Soil electrical conductivity</li>
</ul>

<p>
I've looked previously for NDVI and couldn't find a satisfactory definition (independent of crop type).
</p>
</div>
</div>
