model/README.org
*** TODO Statistical Operations
AUA data includes derived properties produced with the following statistical operations
- Minimum
- Maximum
- Standard Deviation
- Coefficient of Variation

[[https://lov.linkeddata.es/dataset/lov/terms?q=deviation][Searching for deviation]] in Linked Open Vocabularies:
- [[http://semanticscience.org/resource/SIO_000770][SIO:000770]] (SemanticScience Integrated Ontology) "standard deviation".
  Also has [[http://semanticscience.org/resource/SIO_001114][SIO:001114]] "maximal value" and [[http://semanticscience.org/resource/SIO_001113][SIO:001113]] "minimal value",
  but these are defined as SIO:000011 "attribute" of a SIO:000616 "collection".
  No var.
- [[http://purl.obolibrary.org/obo/OBI_0200121][OBI:0200121]] (Ontology for Biomedical Investigations): "standard deviation calculation".
  Includes 10 [[http://purl.obolibrary.org/obo/OBI_0200184][descriptive statistical calculation data transformation]] including kurtosis, skewness, variance. But not min/max/var.
- [[https://w3id.org/seas/StandardDeviationEvaluation][seas-stats:StandardDeviationEvaluation]].
  SEAS includes an alternative ontology of sensors and observations (see gdoc "SEAS").
  Also has DistributionMaximumEvaluation and DistributionMinimumEvaluation but not var.
- [[https://w3id.org/saref4ee#StandardDeviationValue][s4ee:StandardDeviationValue]] (Smart Appliances REFerence, extension for EEBus and Energy@Home) "Standard deviation value".
  Also has AverageValue, MinValue, MaxValue but not var.
- (DICOM has a lot of terms matching this word, but they are not appropriate)
- [[http://ontology.cybershare.utep.edu/ELSEWeb/elseweb-lifemapper-parameters.owl#StandardDeviations][lswpm:StandardDeviations]] (elseweb-lifemapper-parameters: the Earth, Life and Semantic Web (ELSeWeb) project integrates the NASA-funded Earth Data Analysis Center with an analytical Web Service platform, Lifemapper, which models potential future species distributions under scenarios of climate change).
  No min/max, not appropriate
- [[http://mex.aksw.org/mex-perf#standardDeviation][mexperf:standardDeviation]] (Performance Values for Machine Learning Problems):
  no min/max
- [[http://vocab.datex.org/terms#standardDeviation][datex:standardDeviation]] (EU standard for Exchange of Traffic Related Data):
  no min/max

* Data Mapping

** Properties/Variables
The properties that we need fall in the following groups.
For each one we state the ~qb:concept~ (statistical concept) that the property relates to.

*** Geospatial and Temporal Reference
We represent these as DimensionProperties, since they identify the measurement (the measurement is a function of all dimension values).
- Estate: we don't represent this, since it is implied by Plot.
  TODO: Alternatively, we could represent it as a hierarchical level, using ~subdivides~ for the hierarchical relation:
  #+BEGIN_SRC Turtle :tangle no
bdg:estate a qb4st:RefArea;
  rdfs:label "Estate"; rdfs:comment "Estate of a measurement".

bdg:plot qb4st:subdivides bdg:estate.
  #+END_SRC
  Or we could follow QB4OLAP ideas to represent the hierarchical aspect.
- Plot
  #+BEGIN_SRC Turtle
bdg:plot a qb4st:RefArea;
  rdfs:label "Plot"; rdfs:comment "Plot (sub-estate) of a measurement";
  qb:concept sdmx-concept:refArea;
  rdfs:range bdg:Plot.
  #+END_SRC
- Date, Time.
  We use ~Date~ to mark the temporal coverage of the dataset (see [[*Datasets]]),
  and ~Date+Time~ to represent the dateTime of observation.
  #+BEGIN_SRC Turtle
bdg:dateTime a qb:DimensionProperty;
  rdfs:label "Date-time"; rdfs:comment "Date-time of the observation";
  qb:concept sdmx-concept:timePeriod;
  rdfs:range xsd:dateTime.
  #+END_SRC
  Note: ~qb4st:TemporalProperty~ refers to the use of ~time:Interval~ but we prefer to use a simple literal.
  EO QB uses ~qb4st:TemporalProperty~ with a simple literal, which is not consistent: [[https://github.com/w3c/sdw/issues/1108][sdw#1108]].
- Sensor.
  In AUA data we always know the sensor that took the observation (implicitly).
  If that is not the case for some datasets, then we must use an (optional) ~qb:AttributeProperty~, like EO QB does.
  #+BEGIN_SRC Turtle
bdg:sensor a qb:DimensionProperty;
  rdfs:label "Sensor"; rdfs:comment "Sensor/Instrument that took the observation";
  qb:concept sdmx-concept:collMethod;
  rdfs:range ssn:Sensor.
  #+END_SRC

