model/README.html

<div id="outline-container-org7b60983" class="outline-4">
<h4 id="org7b60983"><span class="section-number-4">1.2.2</span> <span class="todo TODO">TODO</span> Statistical Operations</h4>
<div class="outline-text-4" id="text-1-2-2">
<p>
AUA data includes derived properties produced with the following statistical operations
</p>
<ul class="org-ul">
<li>Minimum</li>
<li>Maximum</li>
<li>Standard Deviation</li>
<li>Coefficient of Variation</li>
</ul>

<p>
<a href="https://lov.linkeddata.es/dataset/lov/terms?q=deviation">Searching for deviation</a> in Linked Open Vocabularies:
</p>
<ul class="org-ul">
<li><a href="http://semanticscience.org/resource/SIO_000770">SIO:000770</a> (SemanticScience Integrated Ontology) "standard deviation".
Also has <a href="http://semanticscience.org/resource/SIO_001114">SIO:001114</a> "maximal value" and <a href="http://semanticscience.org/resource/SIO_001113">SIO:001113</a> "minimal value",
but these are defined as SIO:000011 "attribute" of a SIO:000616 "collection".
No var.</li>
<li><a href="http://purl.obolibrary.org/obo/OBI_0200121">OBI:0200121</a> (Ontology for Biomedical Investigations): "standard deviation calculation".
Includes 10 <a href="http://purl.obolibrary.org/obo/OBI_0200184">descriptive statistical calculation data transformation</a> including kurtosis, skewness, variance. But not min/max/var.</li>
<li><a href="https://w3id.org/seas/StandardDeviationEvaluation">seas-stats:StandardDeviationEvaluation</a>.
SEAS includes an alternative ontology of sensors and observations (see gdoc "SEAS").
Also has DistributionMaximumEvaluation and DistributionMinimumEvaluation but not var.</li>
<li><a href="https://w3id.org/saref4ee#StandardDeviationValue">s4ee:StandardDeviationValue</a> (Smart Appliances REFerence, extension for EEBus and Energy@Home) "Standard deviation value".
Also has AverageValue, MinValue, MaxValue but not var.</li>
<li>(DICOM has a lot of terms matching this word, but they are not appropriate)</li>
<li><a href="http://ontology.cybershare.utep.edu/ELSEWeb/elseweb-lifemapper-parameters.owl#StandardDeviations">lswpm:StandardDeviations</a> (elseweb-lifemapper-parameters: the Earth, Life and Semantic Web (ELSeWeb) project integrates the NASA-funded Earth Data Analysis Center with an analytical Web Service platform, Lifemapper, which models potential future species distributions under scenarios of climate change).
No min/max, not appropriate</li>
<li><a href="http://mex.aksw.org/mex-perf#standardDeviation">mexperf:standardDeviation</a> (Performance Values for Machine Learning Problems):
no min/max</li>
<li><a href="http://vocab.datex.org/terms#standardDeviation">datex:standardDeviation</a> (EU standard for Exchange of Traffic Related Data):
no min/max</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org8fa113c" class="outline-2">
<h2 id="org8fa113c"><span class="section-number-2">2</span> Data Mapping</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org56d8018" class="outline-3">
<h3 id="org56d8018"><span class="section-number-3">2.1</span> Properties/Variables</h3>
<div class="outline-text-3" id="text-2-1">
<p>
The properties that we need fall in the following groups.
For each one we state the <code>qb:concept</code> (statistical concept) that the property relates to.
</p>
</div>

<div id="outline-container-org4681c03" class="outline-4">
<h4 id="org4681c03"><span class="section-number-4">2.1.1</span> Geospatial and Temporal Reference</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
We represent these as DimensionProperties, since they identify the measurement (the measurement is a function of all dimension values).
</p>
<ul class="org-ul">
<li><p>
Estate: we don't represent this, since it is implied by Plot.
TODO: Alternatively, we could represent it as a hierarchical level, using <code>subdivides</code> for the hierarchical relation:
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">estate</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb4st:</span><span style="color: #008b8b;">RefArea</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Estate"</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Estate of a measurement"</span><span style="color: #228b22;">.</span>

<span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">plot</span> <span style="color: #228b22;">qb4st:</span><span style="color: #008b8b;">subdivides</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">estate</span>.
</pre>
</div>
<p>
Or we could follow QB4OLAP ideas to represent the hierarchical aspect.
</p></li>
<li><p>
Plot
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">plot</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb4st:</span><span style="color: #008b8b;">RefArea</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Plot"</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Plot (sub-estate) of a measurement"</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span> <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">refArea</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">range</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">Plot</span>.
</pre>
</div></li>
<li><p>
Date, Time.
We use <code>Date</code> to mark the temporal coverage of the dataset (see <a href="#org5b08ddb">2.5</a>),
and <code>Date+Time</code> to represent the dateTime of observation.
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">dateTime</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">DimensionProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Date-time"</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Date-time of the observation"</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span> <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">timePeriod</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">range</span> <span style="color: #228b22;">xsd:</span><span style="color: #008b8b;">dateTime</span>.
</pre>
</div>
<p>
Note: <code>qb4st:TemporalProperty</code> refers to the use of <code>time:Interval</code> but we prefer to use a simple literal.
EO QB uses <code>qb4st:TemporalProperty</code> with a simple literal, which is not consistent: <a href="https://github.com/w3c/sdw/issues/1108">sdw#1108</a>.
</p></li>
<li><p>
Sensor.
In AUA data we always know the sensor that took the observation (implicitly).
If that is not the case for some datasets, then we must use an (optional) <code>qb:AttributeProperty</code>, like EO QB does.
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">sensor</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">DimensionProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Sensor"</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Sensor/Instrument that took the observation"</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span> <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">collMethod</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">range</span> <span style="color: #228b22;">ssn:</span><span style="color: #008b8b;">Sensor</span>.
</pre>
</div></li>
</ul>
</div>
