model/README.org
**** Position
The observation's position is expressed in two ways depending on the dataset:
- Latitude, Longitude (Degrees), Elevation (m) in CRS WGS84
- Northing, Easting (Degrees) in (presumably) in CRS EPSG 32634 (see sec [[*Plots/Geometries]] for details)
Elevation is a bit special because:
- It's functionally dependent on the Plot and Latitude/Longitude:
  the plot's terrain determines the elevation.
  Different sensors could report different elevations for the same point,
  but that would be due to measurement error
- It's missing from some of the datasets
Therefore Elevation cannot be a dimension.

We could represent the coordinates as separate properties but we prefer to represent them as GeoSPARQL literals because:
- The individual coordinates are represented in different CRS, therefore not directly comparable
- Allows automatic comparison of northing/easting to canonical latitude/longitude
- The special status of Elevation as described above
Note: QB4ST does not define a position dimension (only defines ~qb4st:PositionMeasure~),
so we use the slightly more generic ~qb4st:SpatialDimension~.

#+BEGIN_SRC Turtle
bdg:position a qb4st:SpatialDimension;
  rdfs:label "Position"; rdfs:comment "A GeoSPARQL literal";
  qb:concept sdmx-concept:refArea;
  rdfs:subPropertyOf geo:hasSerialization;
  schema:rangeIncludes geo:wktLiteral, geo:gmlLiteral.
#+END_SRC
TODO: Currently GraphDB cannot work with ~geo:wktLiteral~ expressed in non-default CRS.
So we should either:
- Use GML literals only (which are more complex), OR
- Convert WKT literals to CRS84

Deprecated: this needs an extra intermediate node (~geo:Point~) so it's not so good.
#+BEGIN_SRC Turtle :tangle no
bdg:position a qb4st:SpatialDimension;
  rdfs:label "Position"; rdfs:comment """Position of the observation, a geo:Point.
Must have a geometry with qb4st:crs to easily access the CRS, and optionally a geometry in the default/canonical CRS WGS84 for easy comparison";
  qb:concept qb:concept sdmx-concept:refArea;
  rdfs:range geo:Point.
#+END_SRC

