model/README.html

<div id="outline-container-orgfc47d64" class="outline-5">
<h5 id="orgfc47d64"><span class="section-number-5">2.1.1.1</span> Position</h5>
<div class="outline-text-5" id="text-2-1-1-1">
<p>
The observation's position is expressed in two ways depending on the dataset:
</p>
<ul class="org-ul">
<li>Latitude, Longitude (Degrees), Elevation (m) in CRS WGS84</li>
<li>Northing, Easting (Degrees) in (presumably) in CRS EPSG 32634 (see sec <a href="#org5447eee">2.3</a> for details)</li>
</ul>
<p>
Elevation is a bit special because:
</p>
<ul class="org-ul">
<li>It's functionally dependent on the Plot and Latitude/Longitude:
the plot's terrain determines the elevation.
Different sensors could report different elevations for the same point,
but that would be due to measurement error</li>
<li>It's missing from some of the datasets</li>
</ul>
<p>
Therefore Elevation cannot be a dimension.
</p>

<p>
We could represent the coordinates as separate properties but we prefer to represent them as GeoSPARQL literals because:
</p>
<ul class="org-ul">
<li>The individual coordinates are represented in different CRS, therefore not directly comparable</li>
<li>Allows automatic comparison of northing/easting to canonical latitude/longitude</li>
<li>The special status of Elevation as described above</li>
</ul>
<p>
Note: QB4ST does not define a position dimension (only defines <code>qb4st:PositionMeasure</code>),
so we use the slightly more generic <code>qb4st:SpatialDimension</code>.
</p>

<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">position</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb4st:</span><span style="color: #008b8b;">SpatialDimension</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Position"</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"A GeoSPARQL literal"</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span> <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">refArea</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">subPropertyOf</span> <span style="color: #228b22;">geo:</span><span style="color: #008b8b;">hasSerialization</span>;
  <span style="color: #228b22;">schema:</span><span style="color: #008b8b;">rangeIncludes</span> <span style="color: #228b22;">geo:</span><span style="color: #008b8b;">wktLiteral,</span> <span style="color: #228b22;">geo:</span><span style="color: #008b8b;">gmlLiteral</span>.
</pre>
</div>
<p>
TODO: Currently GraphDB cannot work with <code>geo:wktLiteral</code> expressed in non-default CRS.
So we should either:
</p>
<ul class="org-ul">
<li>Use GML literals only (which are more complex), OR</li>
<li>Convert WKT literals to CRS84</li>
</ul>

<p>
Deprecated: this needs an extra intermediate node (<code>geo:Point</code>) so it's not so good.
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">position</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb4st:</span><span style="color: #008b8b;">SpatialDimension</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Position"</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"""Position of the observation, </span><span style="color: #a020f0;">a</span><span style="color: #8b2252;"> </span><span style="color: #228b22;">geo:</span><span style="color: #008b8b;">Point</span><span style="color: #8b2252;">.</span>
<span style="color: #8b2252;">Must have </span><span style="color: #a020f0;">a</span><span style="color: #8b2252;"> geometry with </span><span style="color: #228b22;">qb4st:</span><span style="color: #008b8b;">crs</span><span style="color: #8b2252;"> to easily access the CRS, and optionally </span><span style="color: #a020f0;">a</span><span style="color: #8b2252;"> geometry in the default/canonical CRS WGS84 for easy comparison"</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span> <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">refArea</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">range</span> <span style="color: #228b22;">geo:</span><span style="color: #008b8b;">Point</span>.
</pre>
</div>
</div>
</div>
</div>
