model/README.org
*** Position Qualifiers
We represent these as AttributeProperties, since they qualify the measurement.
- FIXTYPE.
  We represent this as a simple Boolean (false "Fix not valid", true "GPS").
  TODO: if there are more values, we should use a codelist and rename appropriately (eg to ~fixType~).
  #+BEGIN_SRC Turtle
bdg:hasGpsFix a qb:AttributeProperty;
  rdfs:label "Has GPS fix"; rdfs:comment "If the measurement doesn't have a GPS fix, it is invalid and should be discarded";
  qb:concept sdmx-concept:obsStatus; # Information on the quality of a value or an unusual or missing value
  rdfs:range xsd:boolean.
  #+END_SRC
- Sat
  #+BEGIN_SRC Turtle
bdg:satellites a qb:AttributeProperty;
  rdfs:label "Satellites"; rdfs:comment "Number of tracked satellites that provided the GPS fix";
  qb:concept sdmx-concept:collMethod;
  rdfs:range xsd:int.
  #+END_SRC
  TODO: If instead this means "number of satellite that provided the fix", we should rename it.
  Since we don't have info what exactly this number refers to, we should again map it to a simple int, not to ~ssn:Platform~.
- HDOP (Horizontal Dilution of Precision)
  #+BEGIN_SRC Turtle
bdg:HDOP a qb:AttributeProperty;
  skos:notation "HDOP"; rdfs:label "Horizontal dilution of precision";
  rdfs:comment """GPS reception quality:
<1 Ideal, 1-2 Excellent, 2-5 Good, 5-10 Moderate, 10-20 Fair, >20 Poor""";
  qb:concept sdmx-concept:dataValSource; # discrepancies and other problems related to source data
  rdfs:range xsd:int.
    #+END_SRC
- Quality indicator.
  This is a coded property, so we also provide the respective codelist.
  It is represented both as a ~skos:ConceptScheme~ and a ~rdfs:Class~ to enable ~rdfs:range~ checking.
  #+BEGIN_SRC Turtle
bdg:positionQuality a qb:AttributeProperty, qb:CodedProperty;
  qb:codeList <positionQuality>;
  qb:concept sdmx-concept:dataValSource; #: discrepancies and other problems related to source data
  rdfs:label "Position quality"; rdfs:comment "GPS position quality";
  rdfs:range bdg:PositionQuality.

bdg:PositionQuality a rdfs:Class;
  rdfs:subClassOf skos:Concept ;
  rdfs:label "Position Quality codelist class";
  rdfs:seeAlso <positionQuality> .
<positionQuality> a skos:ConceptScheme;
  rdfs:label "Position Quality codelist scheme";
  rdfs:seeAlso bdg:PositionQuality.
<positionQuality-0> a skos:Concept, bdg:PositionQuality;
  skos:inScheme <positionQuality>; skos:topConceptOf <positionQuality>;
  skos:notation "0"; skos:prefLabel "no position";
  skos:scopeNote "Observations without position should be discarded".
<positionQuality-1> a skos:Concept, bdg:PositionQuality;
  skos:inScheme <positionQuality>; skos:topConceptOf <positionQuality>;
  skos:notation "1"; skos:prefLabel "raw, not differentially corrected position".
<positionQuality-2> a skos:Concept, bdg:PositionQuality;
  skos:inScheme <positionQuality>; skos:topConceptOf <positionQuality>;
  skos:notation "2"; skos:prefLabel "differentially corrected position".
<positionQuality-9> a skos:Concept, bdg:PositionQuality;
  skos:inScheme <positionQuality>; skos:topConceptOf <positionQuality>;
  skos:notation "9"; skos:prefLabel "position computed using almanac information)".
  #+END_SRC

