model/README.html

<div id="outline-container-org32ac258" class="outline-4">
<h4 id="org32ac258"><span class="section-number-4">2.1.2</span> Position Qualifiers</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
We represent these as AttributeProperties, since they qualify the measurement.
</p>
<ul class="org-ul">
<li><p>
FIXTYPE.
We represent this as a simple Boolean (false "Fix not valid", true "GPS").
TODO: if there are more values, we should use a codelist and rename appropriately (eg to <code>fixType</code>).
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">hasGpsFix</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">AttributeProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Has GPS fix"</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"If the measurement doesn't have a GPS fix, it is invalid and should be discarded"</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span> <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">obsStatus</span>; <span style="color: #b22222;"># Information on the quality of </span><span style="color: #a020f0;">a</span><span style="color: #b22222;"> value or an unusual or missing value</span>
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">range</span> <span style="color: #228b22;">xsd:</span><span style="color: #008b8b;">boolean</span>.
</pre>
</div></li>
<li><p>
Sat
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">satellites</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">AttributeProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Satellites"</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Number of tracked satellites that provided the GPS fix"</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span> <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">collMethod</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">range</span> <span style="color: #228b22;">xsd:</span><span style="color: #008b8b;">int</span>.
</pre>
</div>
<p>
TODO: If instead this means "number of satellite that provided the fix", we should rename it.
Since we don't have info what exactly this number refers to, we should again map it to a simple int, not to <code>ssn:Platform</code>.
</p></li>
<li><p>
HDOP (Horizontal Dilution of Precision)
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">HDOP</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">AttributeProperty</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span> <span style="color: #8b2252;">"HDOP"</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Horizontal dilution of precision"</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"""GPS reception </span><span style="color: #228b22;">quality:</span>
<span style="color: #0000ff;">&lt;1 Ideal, 1-2 Excellent, 2-5 Good, 5-10 Moderate, 10-20 Fair, &gt;</span><span style="color: #8b2252;">20 Poor"""</span>;
  <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">dataValSource</span>; <span style="color: #228b22;">#:</span><span style="color: #008b8b;"> discrepancies</span><span style="color: #b22222;"> and other problems related to source dat</span><span style="color: #a020f0;">a</span>
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">range</span> <span style="color: #228b22;">xsd:</span><span style="color: #008b8b;">int</span>.
</pre>
</div></li>
<li><p>
Quality indicator.
This is a coded property, so we also provide the respective codelist.
It is represented both as a <code>skos:ConceptScheme</code> and a <code>rdfs:Class</code> to enable <code>rdfs:range</code> checking.
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">positionQuality</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">AttributeProperty,</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">CodedProperty</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">codeList</span> <span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">positionQuality</span>;
  <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">dataValSource</span>; <span style="color: #228b22;">#:</span><span style="color: #008b8b;"> discrepancies</span><span style="color: #b22222;"> and other problems related to source dat</span><span style="color: #a020f0;">a</span>
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Position quality"</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"GPS position quality"</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">range</span> <span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">PositionQuality</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">PositionQuality</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">Class</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">subClassOf</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">Concept</span> ;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Position Quality codelist class"</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Provides code values for Position Quality"</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">seeAlso</span> <span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">positionQuality</span> <span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">positionQuality</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">ConceptScheme</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Position Quality codelist scheme"</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Provides code values for Position Quality"</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">seeAlso</span> <span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">PositionQuality</span> <span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">positionQuality-0</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">PositionQuality</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">positionQuality</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">topConceptOf</span> <span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">positionQuality</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span> <span style="color: #8b2252;">"0"</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span> <span style="color: #8b2252;">"no position"</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">scopeNote</span> <span style="color: #8b2252;">"Observations without position should be discarded"</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">positionQuality-1</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">PositionQuality</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">positionQuality</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">topConceptOf</span> <span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">positionQuality</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span> <span style="color: #8b2252;">"1"</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span> <span style="color: #8b2252;">"raw, not differentially corrected position"</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">positionQuality-2</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">PositionQuality</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">positionQuality</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">topConceptOf</span> <span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">positionQuality</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span> <span style="color: #8b2252;">"2"</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span> <span style="color: #8b2252;">"differentially corrected position"</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">positionQuality-9</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">PositionQuality</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">positionQuality</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">topConceptOf</span> <span style="color: #228b22;">bdg-code:</span><span style="color: #008b8b;">positionQuality</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span> <span style="color: #8b2252;">"9"</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span> <span style="color: #8b2252;">"position computed using almanac information)"</span>.
</pre>
</div></li>
</ul>
</div>
</div>
