model/README.org
*** Features of Interest
Features of interest are AgroBio entities for which we may want to observe some properties:
#+BEGIN_SRC Turtle
<feature/Soil>   a sosa:FeatureOfInterest; rdfs:label "Soil".
<feature/Canopy> a sosa:FeatureOfInterest; rdfs:label "Canopy"; rdfs:description "The leaf mass of some crop".

sosa:hasFeatureOfInterest a qb:MeasureProperty.
#+END_SRC

**** Measurement Contexts
We define some measurement contexts (qualifiers). Following QB practice, we put them in a codelist.
Observations
#+BEGIN_SRC Turtle
bdg:measurementContext a qb:AttributeProperty, qb:CodedProperty;
  qb:codeList <measurementContext>;
  rdfs:range bdg:MeasurementContext.

bdg:MeasurementContext a rdfs:Class;
  rdfs:subClassOf skos:Concept;
  rdfs:label "Measurement Context codelist class".
<measurementContext> a skos:conceptScheme;
  rdfs:label "Measurement Context codelist scheme".
<feature/Soil/separation-1m>   a skos:Concept, bdg:MeasurementContext;
  skos:inScheme <measurementContext>; skos:topConceptOf <measurementContext>;
  rdfs:label "Soil, separation 1m".
<feature/Soil/separation-0.5m> a skos:Concept, bdg:MeasurementContext;
  skos:inScheme <measurementContext>; skos:topConceptOf <measurementContext>;
  rdfs:label "Soil, separation 0.5m".
#+END_SRC
TODO: Not sure what "separation" is: I suspect it could mean "depth".
Depending on the meaning, it may be appropriate to map this to ~sosa:Sample~:
#+BEGIN_SRC Turtle :tangle no
<feature/Soil/depth-1m>   a sosa:Sample; rdfs:label "Soil at depth 1m";
  sosa:isSampleOf <feature/Soil>.
<feature/Soil/depth-0.5m> a sosa:Sample; rdfs:label "Soil at depth 0.5m";
  sosa:isSampleOf <feature/Soil>.
#+END_SRC

*** Observable Properties
The following sub-sections define several properties to hold the observed values.
We declare them ~sosa:ObservableProperty~ because they are observed by a ~sosa:Sensor~,
and ~qb:MeasureProperty~ because they hold the observed/measured value.
These properties bind together:
- *what* is being observed (~FeatureOfInterest~)
- *which* property is observed (~Property~)
- *unit* of measure (~unitMeasure~) and *multiplier* (~unitMult~)
- *context* of observation, if needed
To do this binding we use attributes (~qb:AttributeProperty~)
that are attached to the measure property (see [[*Data Structure Definition]]).
TODO: I notice that each dataset observes only one feature (Soil or Canopy),
so we could simplify by attaching to the dataset. However:
- Attaching to the property is more self-contained (NDVI is always about Canopy)
- We might get a sensor that observes several features at the same time.

