model/README.html

<div id="outline-container-org85e4d5f" class="outline-4">
<h4 id="org85e4d5f"><span class="section-number-4">2.1.3</span> Features of Interest</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
Features of interest are AgroBio entities for which we may want to observe some properties:
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #0000ff;">&lt;feature/Soil&gt;</span>   <span style="color: #a020f0;">a</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">FeatureOfInterest</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Soil"</span>.
<span style="color: #0000ff;">&lt;feature/Canopy&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">FeatureOfInterest</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Canopy"</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">description</span> <span style="color: #8b2252;">"The leaf mass of some crop"</span><span style="color: #228b22;">.</span>

<span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty</span>.
</pre>
</div>
</div>

<div id="outline-container-org603860c" class="outline-5">
<h5 id="org603860c"><span class="section-number-5">2.1.3.1</span> Measurement Contexts</h5>
<div class="outline-text-5" id="text-2-1-3-1">
<p>
We define some measurement contexts (qualifiers). Following QB practice, we put them in a codelist.
Observations
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">measurementContext</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">AttributeProperty</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">codeList</span> <span style="color: #0000ff;">&lt;measurementContext&gt;</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">range</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MeasurementContext</span><span style="color: #228b22;">.</span>

<span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MeasurementContext</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">Class</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">subClassOf</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">Concept</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Measurement Context - codelist class"</span>.

<span style="color: #0000ff;">&lt;measurementContext&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">conceptScheme</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Measurement Context - codelist scheme"</span>.

<span style="color: #0000ff;">&lt;feature/Soil/separation-1m&gt;</span>   <span style="color: #a020f0;">a</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">Concept</span>; <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MeasurementContext</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #0000ff;">&lt;measurementContext&gt;</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">topConceptOf</span> <span style="color: #0000ff;">&lt;measurementContext&gt;</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Soil, separation 1m"</span>.
<span style="color: #0000ff;">&lt;feature/Soil/separation-0.5m&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">Concept</span>; <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MeasurementContext</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #0000ff;">&lt;measurementContext&gt;</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">topConceptOf</span> <span style="color: #0000ff;">&lt;measurementContext&gt;</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Soil, separation 0.5m"</span>.
</pre>
</div>
<p>
TODO: Not sure what "separation" is: I suspect it could mean "depth".
Depending on the meaning, it may be appropriate to map this to <code>sosa:Sample</code>:
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #0000ff;">&lt;feature/Soil/depth-1m&gt;</span>   <span style="color: #a020f0;">a</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">Sample</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Soil at depth 1m"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">isSampleOf</span> <span style="color: #0000ff;">&lt;feature/Soil&gt;</span>.
<span style="color: #0000ff;">&lt;feature/Soil/depth-0.5m&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">Sample</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Soil at depth 0.5m"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">isSampleOf</span> <span style="color: #0000ff;">&lt;feature/Soil&gt;</span>.
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga436f1e" class="outline-4">
<h4 id="orga436f1e"><span class="section-number-4">2.1.4</span> Observable Properties</h4>
<div class="outline-text-4" id="text-2-1-4">
<p>
The following sub-sections define several properties to hold the observed values.
We declare them <code>sosa:ObservableProperty</code> because they are observed by a <code>sosa:Sensor</code>,
and <code>qb:MeasureProperty</code> because they hold the observed/measured value.
These properties bind together:
</p>
<ul class="org-ul">
<li><b>what</b> is being observed (<code>FeatureOfInterest</code>)</li>
<li><b>which</b> property is observed (<code>Property</code>)</li>
<li><b>unit</b> of measure (<code>unitMeasure</code>) and <b>multiplier</b> (<code>unitMult</code>)</li>
<li><b>context</b> of observation, if needed</li>
</ul>
<p>
To do this binding we use attributes (<code>qb:AttributeProperty</code>)
that are attached to the measure property (see <a href="#org5b3d0a4">2.4</a>).
TODO: I notice that each dataset observes only one feature (Soil or Canopy),
so we could simplify by attaching to the dataset. However:
</p>
<ul class="org-ul">
<li>Attaching to the property is more self-contained (NDVI is always about Canopy)</li>
<li>We might get a sensor that observes several features at the same time.</li>
</ul>
</div>
