model/README.org
**** Soil Conductivity
We have two properties that differ only by context:
- CV05m (soil conductivity, separation 0.5 m) (mS/m)
- CV1m (soil conductivity, separation 1.0 m) (mS/m)

#+BEGIN_SRC Turtle
bdg:CV1m a qb:MeasureProperty, sosa:ObservableProperty;
  rdfs:label                 "Soil Electric Conductivity, separation 1m";
  skos:notation              "CV1m";
  sosa:hasFeatureOfInterest  <feature/Soil>;
  bdg:measurementContext     <feature/Soil/separation-1m>;
  qudt:hasQuantityKind       quantitykind:ElectricConductivity;
  sdmx-attribute:unitMeasure unit:S-PER-M; # Siemens per meter
  sdmx-attribute:unitMult    unit:Milli; # 10^-3
  qb:concept                 sdmx-concept:obsValue.

bdg:CV05m a qb:MeasureProperty, sosa:ObservableProperty;
  rdfs:label                 "Soil Electric Conductivity, separation 0.5m";
  skos:notation              "CV0.5m";
  sosa:hasFeatureOfInterest  <feature/Soil>;
  bdg:measurementContext     <feature/Soil/separation-0.5m>;
  qudt:hasQuantityKind       quantitykind:ElectricConductivity;
  sdmx-attribute:unitMeasure unit:S-PER-M; # Siemens per meter
  sdmx-attribute:unitMult    unit:Milli; # 10^-3
  qb:concept                 sdmx-concept:obsValue.
#+END_SRC
Notes:
- We abuse ~sosa:hasFeatureOfInterest~, which is intended to be applied to ~sosa:Observation~ not ~sosa:ObservableProperty~
  - This allows us to find easily all properties that pertain to a given feature of interest
  - There is no formal violation because ~sosa:hasFeatureOfInterest~
    doesn't use the prescriptive ~rdfs:domain~ but the descriptive ~rdfs:domainIncludes~
- We slightly abuse ~sdmx-attribute:unitMult~ by using ~unit:Milli~ as its value.
  - SDMX defines a codelist ~sdmx-code:unitMult~, but it doesn't have fractional miltipliers
    (population statistics deals with thousands and millions, not with *thousandths*)
  - ~sdmx-attribute:unitMult~ doesn't actually declare a ~qb:codeList~, so that's ok
- http://qudt.org/2.0/schema/qudt/science defines ~qudt:DecimalScaledUnit~
  but http://qudt.org/2.0/vocab/unit/electromagnetism defines decimal fractions only of Ampere and Coulomb, not Siemens.
- TODO: alternatively, we could define ~Milli-S-PER-M~ ourselves:
  #+BEGIN_SRC Turtle :tangle no
bdg-unit:Milli-S-PER-M a qudt:DecimalScaledUnit, qudt:DerivedUnit, qudt:ConductanceUnit, qudt:Unit;
  qudt:hasMultiplier unit:Milli;
  qudt:conversionMultiplier 1.0e-3 ;
  qudt:conversionOffset "0.0"^^xsd:double ;
  qudt:hasQuantityKind quantitykind:ElectricConductivity ;
  qudt:isScalingOf unit:S-PER-M ;
  prov:wasDerivedFrom unit:S-PER-M .
  #+END_SRC

