model/README.html

<div id="outline-container-org9097266" class="outline-5">
<h5 id="org9097266"><span class="section-number-5">2.1.4.1</span> Soil Conductivity</h5>
<div class="outline-text-5" id="text-2-1-4-1">
<p>
We have two properties that differ only by context:
</p>
<ul class="org-ul">
<li>CV05m (soil conductivity, separation 0.5 m) (mS/m)</li>
<li>CV1m (soil conductivity, separation 1.0 m) (mS/m)</li>
</ul>

<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">CV1m</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty,</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">ObservableProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span>                 <span style="color: #8b2252;">"Soil Electric Conductivity, separation 1m"</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span>              <span style="color: #8b2252;">"CV1m"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  <span style="color: #0000ff;">&lt;feature/Soil&gt;</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">measurementContext</span>     <span style="color: #0000ff;">&lt;feature/Soil/separation-1m&gt;</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       <span style="color: #228b22;">quantitykind:</span><span style="color: #008b8b;">ElectricConductivity</span>;
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">S-PER-M</span>; <span style="color: #b22222;"># Siemens per meter</span>
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMult</span>    <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">Milli</span>; <span style="color: #b22222;"># 10^-3</span>
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span>                 <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">obsValue</span><span style="color: #228b22;">.</span>

<span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">CV05m</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty,</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">ObservableProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span>                 <span style="color: #8b2252;">"Soil Electric Conductivity, separation 0.5m"</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span>              <span style="color: #8b2252;">"CV0.5m"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  <span style="color: #0000ff;">&lt;feature/Soil&gt;</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">measurementContext</span>     <span style="color: #0000ff;">&lt;feature/Soil/separation-0.5m&gt;</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       <span style="color: #228b22;">quantitykind:</span><span style="color: #008b8b;">ElectricConductivity</span>.
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">S-PER-M</span> <span style="color: #b22222;"># Siemens per meter</span>
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMult</span>    <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">Milli</span>; <span style="color: #b22222;"># 10^-3</span>
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span>                 <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">obsValue</span>.
</pre>
</div>
<p>
Notes:
</p>
<ul class="org-ul">
<li>We abuse <code>sosa:hasFeatureOfInterest</code>, which is intended to be applied to <code>sosa:Observation</code> not <code>sosa:ObservableProperty</code>
<ul class="org-ul">
<li>This allows us to find easily all properties that pertain to a given feature of interest</li>
<li>There is no formal violation because <code>sosa:hasFeatureOfInterest</code>
doesn't use the prescriptive <code>rdfs:domain</code> but the descriptive <code>rdfs:domainIncludes</code></li>
</ul></li>
<li>We slightly abuse <code>sdmx-attribute:unitMult</code> by using <code>unit:Milli</code> as its value.
<ul class="org-ul">
<li>SDMX defines a codelist <code>sdmx-code:unitMult</code>, but it doesn't have fractional miltipliers
(population statistics deals with thousands and millions, not with <b>thousandths</b>)</li>
<li><code>sdmx-attribute:unitMult</code> doesn't actually declare a <code>qb:codeList</code>, so that's ok</li>
</ul></li>
<li><a href="http://qudt.org/2.0/schema/qudt/science">http://qudt.org/2.0/schema/qudt/science</a> defines <code>qudt:DecimalScaledUnit</code>
but <a href="http://qudt.org/2.0/vocab/unit/electromagnetism">http://qudt.org/2.0/vocab/unit/electromagnetism</a> defines decimal fractions only of Ampere and Coulomb, not Siemens.</li>
<li><p>
TODO: alternatively, we could define <code>Milli-S-PER-M</code> ourselves:
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">bdg-unit:</span><span style="color: #008b8b;">Milli-S-PER-M</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">DecimalScaledUnit,</span> <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">DerivedUnit,</span> <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">ConductanceUnit,</span> <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">Unit</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasMultiplier</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">Milli</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">conversionMultiplier</span> 1.0e-3 ;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">conversionOffset</span> <span style="color: #8b2252;">"0.0"</span><span style="color: #228b22;">^^xsd:</span><span style="color: #008b8b;">double</span> ;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span> <span style="color: #228b22;">quantitykind:</span><span style="color: #008b8b;">ElectricConductivity</span> ;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">isScalingOf</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">S-PER-M</span> ;
  <span style="color: #228b22;">prov:</span><span style="color: #008b8b;">wasDerivedFrom</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">S-PER-M</span> .
</pre>
</div></li>
</ul>
</div>
</div>
