model/README.org
**** Canopy Characteristics
These are primary observation data:
- NIRi (NIR Incident) (%)
- NIRr (NIR Reflected) (%)
- RE (Red Edge) (%)
- REDi (RED Incident) (%)
- REDr (RED Reflected) (%)
TODO: these labels are incomplete, they should say "percentage of radiation" or something.
#+BEGIN_SRC Turtle
bdg:NIRi a qb:MeasureProperty, sosa:ObservableProperty;
  rdfs:label                 "NIR Incident";
  skos:notation              "NIRi";
  sosa:hasFeatureOfInterest  <feature/Canopy>;
  qudt:hasQuantityKind       quantitykind:Dimensionless;
  sdmx-attribute:unitMeasure unit:PERCENT;
  qb:concept                 sdmx-concept:obsValue.
bdg:NIRr a qb:MeasureProperty, sosa:ObservableProperty;
  rdfs:label                 "NIR Reflected";
  skos:notation              "NIRr";
  sosa:hasFeatureOfInterest  <feature/Canopy>;
  qudt:hasQuantityKind       quantitykind:Dimensionless;
  sdmx-attribute:unitMeasure unit:PERCENT;
  qb:concept                 sdmx-concept:obsValue.
bdg:RE a qb:MeasureProperty, sosa:ObservableProperty;
  rdfs:label                 "Red Edge";
  skos:notation              "RE";
  sosa:hasFeatureOfInterest  <feature/Canopy>;
  qudt:hasQuantityKind       quantitykind:Dimensionless;
  sdmx-attribute:unitMeasure unit:PERCENT;
  qb:concept                 sdmx-concept:obsValue.
bdg:REDi a qb:MeasureProperty, sosa:ObservableProperty;
  rdfs:label                 "RED Incident";
  skos:notation              "REDi";
  sosa:hasFeatureOfInterest  <feature/Canopy>;
  qudt:hasQuantityKind       quantitykind:Dimensionless;
  sdmx-attribute:unitMeasure unit:PERCENT;
  qb:concept                 sdmx-concept:obsValue.
bdg:REDr a qb:MeasureProperty, sosa:ObservableProperty;
  rdfs:label                 "RED Reflected";
  skos:notation              "REDr";
  sosa:hasFeatureOfInterest  <feature/Canopy>;
  qudt:hasQuantityKind       quantitykind:Dimensionless;
  sdmx-attribute:unitMeasure unit:PERCENT;
  qb:concept                 sdmx-concept:obsValue.
#+END_SRC

