model/README.html

<div id="outline-container-org686dd52" class="outline-5">
<h5 id="org686dd52"><span class="section-number-5">2.1.4.2</span> Canopy Characteristics</h5>
<div class="outline-text-5" id="text-2-1-4-2">
<p>
These are primary observation data:
</p>
<ul class="org-ul">
<li>NIRi (NIR Incident) (%)</li>
<li>NIRr (NIR Reflected) (%)</li>
<li>RE (Red Edge) (%)</li>
<li>REDi (RED Incident) (%)</li>
<li>REDr (RED Reflected) (%)</li>
</ul>
<p>
TODO: these labels are incomplete, they should say "percentage of radiation" or something.
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NIRi</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty,</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">ObservableProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span>                 <span style="color: #8b2252;">"NIR Incident"</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span>              <span style="color: #8b2252;">"NIRi"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  <span style="color: #0000ff;">&lt;feature/Canopy&gt;</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       <span style="color: #228b22;">quantitykind:</span><span style="color: #008b8b;">Dimensionless</span>;
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">PERCENT</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span>                 <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">obsValue</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NIRr</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty,</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">ObservableProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span>                 <span style="color: #8b2252;">"NIR Reflected"</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span>              <span style="color: #8b2252;">"NIRr"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  <span style="color: #0000ff;">&lt;feature/Canopy&gt;</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       <span style="color: #228b22;">quantitykind:</span><span style="color: #008b8b;">Dimensionless</span>;
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">PERCENT</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span>                 <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">obsValue</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">RE</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty,</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">ObservableProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span>                 <span style="color: #8b2252;">"Red Edge"</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span>              <span style="color: #8b2252;">"RE"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  <span style="color: #0000ff;">&lt;feature/Canopy&gt;</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       <span style="color: #228b22;">quantitykind:</span><span style="color: #008b8b;">Dimensionless</span>;
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">PERCENT</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span>                 <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">obsValue</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">REDi</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty,</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">ObservableProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span>                 <span style="color: #8b2252;">"RED Incident"</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span>              <span style="color: #8b2252;">"REDi"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  <span style="color: #0000ff;">&lt;feature/Canopy&gt;</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       <span style="color: #228b22;">quantitykind:</span><span style="color: #008b8b;">Dimensionless</span>;
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">PERCENT</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span>                 <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">obsValue</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">REDr</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty,</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">ObservableProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span>                 <span style="color: #8b2252;">"RED Reflected"</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span>              <span style="color: #8b2252;">"REDr"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  <span style="color: #0000ff;">&lt;feature/Canopy&gt;</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       <span style="color: #228b22;">quantitykind:</span><span style="color: #008b8b;">Dimensionless</span>;
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">PERCENT</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span>                 <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">obsValue</span>.
</pre>
</div>
</div>
</div>
