model/README.org
**** Derived Vegetation Indices
These are derived observations computed from primary observations.
As such they are redundant and in principle could be omitted,
but some sensors emit only the derived
- LAI (Leaf Area Index) = 0.014*(exp(6.192*NDVI)
- NDRE (Normalized Difference Red Edge Index) = (NIR-RedEdge)/(NIR+RedEdge)
- NDVI (Normalized Difference Vegetation Index) = (NIR-RED)/(NIR+RED)
- NIR (Near Infrared) = NIRr/NIRi
- RED (Red spectrum) = REDr/REDi
We record the primary observations from which this one is derived,
and the formula in ~qudt:mathDefinition~ (that is basically a comment),
- TODO: I'm not sure whether these are considered percentages or simply dimensionless.
  It doesn't make a lot of difference because percentages are dimensionless anyway.
#+BEGIN_SRC Turtle
bdg:LAI a qb:MeasureProperty, sosa:ObservableProperty;
  rdfs:label                 "Leaf Area Index";
  skos:notation              "LAI";
  sosa:hasFeatureOfInterest  <feature/Canopy>;
  qudt:hasQuantityKind       quantitykind:Dimensionless;
  sdmx-attribute:unitMeasure unit:NUM;
  qudt:mathDefinition        "0.014*(exp(6.192*NDVI)";
  bdg:derivedFrom            bdg:NDVI;
  qb:concept                 sdmx-concept:obsValue.
bdg:NDRE a qb:MeasureProperty, sosa:ObservableProperty;
  rdfs:label                 "Normalized Difference Red Edge Index";
  skos:notation              "NDRE";
  sosa:hasFeatureOfInterest  <feature/Canopy>;
  qudt:hasQuantityKind       quantitykind:Dimensionless;
  sdmx-attribute:unitMeasure unit:NUM;
  qudt:mathDefinition        "(NIR-RE)/(NIR+RE)";
  bdg:derivedFrom            bdg:NIR, bdg:RE;
  qb:concept                 sdmx-concept:obsValue.
bdg:NDVI a qb:MeasureProperty, sosa:ObservableProperty;
  rdfs:label                 "Normalized Difference Vegetation Index";
  skos:notation              "NDVI";
  sosa:hasFeatureOfInterest  <feature/Canopy>;
  qudt:hasQuantityKind       quantitykind:Dimensionless;
  sdmx-attribute:unitMeasure unit:NUM;
  qudt:mathDefinition        "(NIR-RED)/(NIR+RED)";
  bdg:derivedFrom            bdg:NIR, bdg:RED;
  qb:concept                 sdmx-concept:obsValue.
bdg:NIR a qb:MeasureProperty, sosa:ObservableProperty;
  rdfs:label                 "Near Infrared";
  skos:notation              "NIR";
  sosa:hasFeatureOfInterest  <feature/Canopy>;
  qudt:hasQuantityKind       quantitykind:Dimensionless;
  sdmx-attribute:unitMeasure unit:NUM;
  qudt:mathDefinition        "NIRr/NIRi";
  bdg:derivedFrom            bdg:NIRr, bdg:NIRi;
  qb:concept                 sdmx-concept:obsValue.
bdg:RED a qb:MeasureProperty, sosa:ObservableProperty;
  rdfs:label                 "Red spectrum";
  skos:notation              "RED";
  sosa:hasFeatureOfInterest  <feature/Canopy>;
  qudt:hasQuantityKind       quantitykind:Dimensionless;
  sdmx-attribute:unitMeasure unit:NUM;
  qudt:mathDefinition        "REDr/REDi";
  bdg:derivedFrom            bdg:REDr, bdg:REDi;
  qb:concept                 sdmx-concept:obsValue.
#+END_SRC

