model/README.html

<div id="outline-container-orgb5dafee" class="outline-5">
<h5 id="orgb5dafee"><span class="section-number-5">2.1.4.3</span> Derived Vegetation Indices</h5>
<div class="outline-text-5" id="text-2-1-4-3">
<p>
These are derived observations computed from primary observations.
As such they are redundant and in principle could be omitted,
but some sensors emit only the derived
</p>
<ul class="org-ul">
<li>LAI (Leaf Area Index) = 0.014*(exp(6.192*NDVI)</li>
<li>NDRE (Normalized Difference Red Edge Index) = (NIR-RedEdge)/(NIR+RedEdge)</li>
<li>NDVI (Normalized Difference Vegetation Index) = (NIR-RED)/(NIR+RED)</li>
<li>NIR (Near Infrared) = NIRr/NIRi</li>
<li>RED (Red spectrum) = REDr/REDi</li>
</ul>
<p>
We record the primary observations from which this one is derived,
and the formula in <code>qudt:mathDefinition</code> (that is basically a comment),
</p>
<ul class="org-ul">
<li>TODO: I'm not sure whether these are considered percentages or simply dimensionless.
It doesn't make a lot of difference because percentages are dimensionless anyway.</li>
</ul>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">LAI</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty,</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">ObservableProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span>                 <span style="color: #8b2252;">"Leaf Area Index"</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span>              <span style="color: #8b2252;">"LAI"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  <span style="color: #0000ff;">&lt;feature/Canopy&gt;</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       <span style="color: #228b22;">quantitykind:</span><span style="color: #008b8b;">Dimensionless</span>;
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">NUM</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">mathDefinition</span>        <span style="color: #8b2252;">"0.014*(exp(6.192*NDVI)"</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">derivedFrom</span>            <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NDVI</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span>                 <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">obsValue</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NDRE</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty,</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">ObservableProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span>                 <span style="color: #8b2252;">"Normalized Difference Red Edge Index"</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span>              <span style="color: #8b2252;">"NDRE"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  <span style="color: #0000ff;">&lt;feature/Canopy&gt;</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       <span style="color: #228b22;">quantitykind:</span><span style="color: #008b8b;">Dimensionless</span>;
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">NUM</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">mathDefinition</span>        <span style="color: #8b2252;">"(NIR-RE)/(NIR+RE)"</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">derivedFrom</span>            <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NIR,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">RE</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span>                 <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">obsValue</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NDVI</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty,</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">ObservableProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span>                 <span style="color: #8b2252;">"Normalized Difference Vegetation Index"</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span>              <span style="color: #8b2252;">"NDVI"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  <span style="color: #0000ff;">&lt;feature/Canopy&gt;</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       <span style="color: #228b22;">quantitykind:</span><span style="color: #008b8b;">Dimensionless</span>;
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">NUM</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">mathDefinition</span>        <span style="color: #8b2252;">"(NIR-RED)/(NIR+RED)"</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">derivedFrom</span>            <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NIR,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">RED</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span>                 <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">obsValue</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NIR</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty,</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">ObservableProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span>                 <span style="color: #8b2252;">"Near Infrared"</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span>              <span style="color: #8b2252;">"NIR"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  <span style="color: #0000ff;">&lt;feature/Canopy&gt;</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       <span style="color: #228b22;">quantitykind:</span><span style="color: #008b8b;">Dimensionless</span>;
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">NUM</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">mathDefinition</span>        <span style="color: #8b2252;">"NIRr/NIRi"</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">derivedFrom</span>            <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NIRr,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NIRi</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span>                 <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">obsValue</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">RED</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty,</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">ObservableProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span>                 <span style="color: #8b2252;">"Red spectrum"</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span>              <span style="color: #8b2252;">"RED"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  <span style="color: #0000ff;">&lt;feature/Canopy&gt;</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       <span style="color: #228b22;">quantitykind:</span><span style="color: #008b8b;">Dimensionless</span>;
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">NUM</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">mathDefinition</span>        <span style="color: #8b2252;">"REDr/REDi"</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">derivedFrom</span>            <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">REDr,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">REDi</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span>                 <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">obsValue</span>.
</pre>
</div>
</div>
</div>
