model/README.org
**** Statistical Summaries of Vegetation Indices
These are secondary observations providing statistical summaries of a primary observation:
- CVNDRE (Coefficient of variation NDRE)
- CVNDVI (Coefficient of variation NDVI)
- MAXNDRE (Maximum value NDRE)
- MAXNDV (Maximum value NDVI)
- MINNDRE (Minimum value NDRE)
- MINNDVI (Minimum value NDVI)
- STDNDRE (Standard deviation NDRE)
- STDNDVI (Standard deviation NDVI)
We record both the primary observation, and the statistical summary operation:
#+BEGIN_SRC Turtle
bdg:CVNDRE a qb:MeasureProperty, sosa:ObservableProperty;
  rdfs:label                 "Coefficient of variation NDRE";
  skos:notation              "CVNDRE";
  sosa:hasFeatureOfInterest  <feature/Canopy>;
  qudt:hasQuantityKind       quantitykind:Dimensionless;
  sdmx-attribute:unitMeasure unit:NUM;
  bdg:statisticalSummary     <statisticalSummary/CoefficientOfVariation>;
  bdg:derivedFrom            bdg:NDRE;
  qb:concept                 sdmx-concept:obsValue.
bdg:CVNDVI a qb:MeasureProperty, sosa:ObservableProperty;
  rdfs:label                 "Coefficient of variation NDVI";
  skos:notation              "CVNDVI";
  sosa:hasFeatureOfInterest  <feature/Canopy>;
  qudt:hasQuantityKind       quantitykind:Dimensionless;
  sdmx-attribute:unitMeasure unit:NUM;
  bdg:statisticalSummary     <statisticalSummary/CoefficientOfVariation>;
  bdg:derivedFrom            bdg:NDVI;
  qb:concept                 sdmx-concept:obsValue.
bdg:MAXNDRE a qb:MeasureProperty, sosa:ObservableProperty;
  rdfs:label                 "Maximum value NDRE";
  skos:notation              "MAXNDRE";
  sosa:hasFeatureOfInterest  <feature/Canopy>;
  qudt:hasQuantityKind       quantitykind:Dimensionless;
  sdmx-attribute:unitMeasure unit:NUM;
  bdg:statisticalSummary     <statisticalSummary/Maximum>;
  bdg:derivedFrom            bdg:NDRE;
  qb:concept                 sdmx-concept:obsValue.
bdg:MAXNDV a qb:MeasureProperty, sosa:ObservableProperty;
  rdfs:label                 "Maximum value NDVI";
  skos:notation              "MAXNDV";
  sosa:hasFeatureOfInterest  <feature/Canopy>;
  qudt:hasQuantityKind       quantitykind:Dimensionless;
  sdmx-attribute:unitMeasure unit:NUM;
  bdg:statisticalSummary     <statisticalSummary/Maximum>;
  bdg:derivedFrom            bdg:NDVI;
  qb:concept                 sdmx-concept:obsValue.
bdg:MINNDRE a qb:MeasureProperty, sosa:ObservableProperty;
  rdfs:label                 "Minimum value NDRE";
  skos:notation              "MINNDRE";
  sosa:hasFeatureOfInterest  <feature/Canopy>;
  qudt:hasQuantityKind       quantitykind:Dimensionless;
  sdmx-attribute:unitMeasure unit:NUM;
  bdg:statisticalSummary     <statisticalSummary/Minimum>;
  bdg:derivedFrom            bdg:NDRE;
  qb:concept                 sdmx-concept:obsValue.
bdg:MINNDVI a qb:MeasureProperty, sosa:ObservableProperty;
  rdfs:label                 "Minimum value NDVI";
  skos:notation              "MINNDVI";
  sosa:hasFeatureOfInterest  <feature/Canopy>;
  qudt:hasQuantityKind       quantitykind:Dimensionless;
  sdmx-attribute:unitMeasure unit:NUM;
  bdg:statisticalSummary     <statisticalSummary/Minimum>;
  bdg:derivedFrom            bdg:NDVI;
  qb:concept                 sdmx-concept:obsValue.
bdg:STDNDRE a qb:MeasureProperty, sosa:ObservableProperty;
  rdfs:label                 "Standard deviation NDRE";
  skos:notation              "STDNDRE";
  sosa:hasFeatureOfInterest  <feature/Canopy>;
  qudt:hasQuantityKind       quantitykind:Dimensionless;
  sdmx-attribute:unitMeasure unit:NUM;
  bdg:statisticalSummary     <statisticalSummary/StandardDeviation>;
  bdg:derivedFrom            bdg:NDRE;
  qb:concept                 sdmx-concept:obsValue.
bdg:STDNDVI a qb:MeasureProperty, sosa:ObservableProperty;
  rdfs:label                 "Standard deviation NDVI";
  skos:notation              "STDNDVI";
  sosa:hasFeatureOfInterest  <feature/Canopy>;
  qudt:hasQuantityKind       quantitykind:Dimensionless;
  sdmx-attribute:unitMeasure unit:NUM;
  bdg:statisticalSummary     <statisticalSummary/StandardDeviation>;
  bdg:derivedFrom            bdg:NDVI;
  qb:concept                 sdmx-concept:obsValue.
#+END_SRC

We define statistical summary operations as a codelist: ConceptScheme, and corresponding class to enable ~rdfs:range~ checking
#+BEGIN_SRC Turtle
bdg:statisticalSummary a qb:AttributeProperty, qb:CodedProperty;
  rdfs:label "Statistical Summary"; rdfs:comment "Summary operation used on a property to derive another";
  qb:codeList <statisticalSummary>;
  rdfs:range bdg:StatisticalSummary.

<statisticalSummary> a skos:ConceptScheme;
  rdfs:label "Statistical Summary codelist scheme".
bdg:Statisticalsummary a rdfs:Class; rdfs:subClassOf skos:Concept;
  rdfs:label "Statistical Summary codelist class".
<statisticalSummary/Minimum> a skos:Concept, bdg:StatisticalSummary;
  skos:inScheme <statisticalSummary>; skos:topConceptOf <statisticalSummary>;
  skos:prefLabel "Minimum".
<statisticalSummary/Maximum> a skos:Concept, bdg:StatisticalSummary;
  skos:inScheme <statisticalSummary>; skos:topConceptOf <statisticalSummary>;
  skos:prefLabel "Maximum".
<statisticalSummary/CoefficientOfVariation> a skos:Concept, bdg:StatisticalSummary;
  skos:inScheme <statisticalSummary>; skos:topConceptOf <statisticalSummary>;
  skos:prefLabel "Coefficient of variation".
<statisticalSummary/StandardDeviation> a skos:Concept, bdg:StatisticalSummary;
  skos:inScheme <statisticalSummary>; skos:topConceptOf <statisticalSummary>;
  skos:prefLabel "Maximum".
#+END_SRC

