model/README.html

<div id="outline-container-org4a8b288" class="outline-5">
<h5 id="org4a8b288"><span class="section-number-5">2.1.4.4</span> Statistical Summaries of Vegetation Indices</h5>
<div class="outline-text-5" id="text-2-1-4-4">
<p>
These are secondary observations providing statistical summaries of a primary observation:
</p>
<ul class="org-ul">
<li>CVNDRE (Coefficient of variation NDRE)</li>
<li>CVNDVI (Coefficient of variation NDVI)</li>
<li>MAXNDRE (Maximum value NDRE)</li>
<li>MAXNDV (Maximum value NDVI)</li>
<li>MINNDRE (Minimum value NDRE)</li>
<li>MINNDVI (Minimum value NDVI)</li>
<li>STDNDRE (Standard deviation NDRE)</li>
<li>STDNDVI (Standard deviation NDVI)</li>
</ul>
<p>
We record both the primary observation, and the statistical summary operation:
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">CVNDRE</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty,</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">ObservableProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span>                 <span style="color: #8b2252;">"Coefficient of variation NDRE"</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span>              <span style="color: #8b2252;">"CVNDRE"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  <span style="color: #0000ff;">&lt;feature/Canopy&gt;</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       <span style="color: #228b22;">quantitykind:</span><span style="color: #008b8b;">Dimensionless</span>;
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">NUM</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">statisticalSummary</span>     <span style="color: #0000ff;">&lt;statisticalSummary/CoefficientOfVariation&gt;</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">derivedFrom</span>            <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NDRE</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span>                 <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">obsValue</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">CVNDVI</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty,</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">ObservableProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span>                 <span style="color: #8b2252;">"Coefficient of variation NDVI"</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span>              <span style="color: #8b2252;">"CVNDVI"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  <span style="color: #0000ff;">&lt;feature/Canopy&gt;</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       <span style="color: #228b22;">quantitykind:</span><span style="color: #008b8b;">Dimensionless</span>;
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">NUM</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">statisticalSummary</span>     <span style="color: #0000ff;">&lt;statisticalSummary/CoefficientOfVariation&gt;</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">derivedFrom</span>            <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NDVI</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span>                 <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">obsValue</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MAXNDRE</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty,</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">ObservableProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span>                 <span style="color: #8b2252;">"Maximum value NDRE"</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span>              <span style="color: #8b2252;">"MAXNDRE"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  <span style="color: #0000ff;">&lt;feature/Canopy&gt;</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       <span style="color: #228b22;">quantitykind:</span><span style="color: #008b8b;">Dimensionless</span>;
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">NUM</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">statisticalSummary</span>     <span style="color: #0000ff;">&lt;statisticalSummary/Maximum&gt;</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">derivedFrom</span>            <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NDRE</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span>                 <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">obsValue</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MAXNDV</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty,</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">ObservableProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span>                 <span style="color: #8b2252;">"Maximum value NDVI"</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span>              <span style="color: #8b2252;">"MAXNDV"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  <span style="color: #0000ff;">&lt;feature/Canopy&gt;</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       <span style="color: #228b22;">quantitykind:</span><span style="color: #008b8b;">Dimensionless</span>;
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">NUM</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">statisticalSummary</span>     <span style="color: #0000ff;">&lt;statisticalSummary/Maximum&gt;</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">derivedFrom</span>            <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NDVI</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span>                 <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">obsValue</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MINNDRE</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty,</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">ObservableProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span>                 <span style="color: #8b2252;">"Minimum value NDRE"</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span>              <span style="color: #8b2252;">"MINNDRE"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  <span style="color: #0000ff;">&lt;feature/Canopy&gt;</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       <span style="color: #228b22;">quantitykind:</span><span style="color: #008b8b;">Dimensionless</span>;
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">NUM</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">statisticalSummary</span>     <span style="color: #0000ff;">&lt;statisticalSummary/Minimum&gt;</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">derivedFrom</span>            <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NDRE</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span>                 <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">obsValue</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MINNDVI</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty,</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">ObservableProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span>                 <span style="color: #8b2252;">"Minimum value NDVI"</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span>              <span style="color: #8b2252;">"MINNDVI"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  <span style="color: #0000ff;">&lt;feature/Canopy&gt;</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       <span style="color: #228b22;">quantitykind:</span><span style="color: #008b8b;">Dimensionless</span>;
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">NUM</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">statisticalSummary</span>     <span style="color: #0000ff;">&lt;statisticalSummary/Minimum&gt;</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">derivedFrom</span>            <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NDVI</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span>                 <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">obsValue</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">STDNDRE</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty,</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">ObservableProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span>                 <span style="color: #8b2252;">"Standard deviation NDRE"</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span>              <span style="color: #8b2252;">"STDNDRE"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  <span style="color: #0000ff;">&lt;feature/Canopy&gt;</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       <span style="color: #228b22;">quantitykind:</span><span style="color: #008b8b;">Dimensionless</span>;
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">NUM</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">statisticalSummary</span>     <span style="color: #0000ff;">&lt;statisticalSummary/StandardDeviation&gt;</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">derivedFrom</span>            <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NDRE</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span>                 <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">obsValue</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">STDNDVI</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">MeasureProperty,</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">ObservableProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span>                 <span style="color: #8b2252;">"Standard deviation NDVI"</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">notation</span>              <span style="color: #8b2252;">"STDNDVI"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  <span style="color: #0000ff;">&lt;feature/Canopy&gt;</span>;
  <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       <span style="color: #228b22;">quantitykind:</span><span style="color: #008b8b;">Dimensionless</span>;
  <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> <span style="color: #228b22;">unit:</span><span style="color: #008b8b;">NUM</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">statisticalSummary</span>     <span style="color: #0000ff;">&lt;statisticalSummary/StandardDeviation&gt;</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">derivedFrom</span>            <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NDVI</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">concept</span>                 <span style="color: #228b22;">sdmx-concept:</span><span style="color: #008b8b;">obsValue</span>.
</pre>
</div>

<p>
We define statistical summary operations as a codelist: ConceptScheme, and corresponding class to enable <code>rdfs:range</code> checking
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">statisticalSummary</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">AttributeProperty,</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">CodedProperty</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Statistical Summary"</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Summary operation used on a property to derive another"</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">codeList</span> <span style="color: #0000ff;">&lt;statisticalSummary&gt;</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">range</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">StatisticalSummary</span>.
<span style="color: #0000ff;">&lt;statisticalSummary&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">ConceptScheme</span>;                         <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Statistical Summary - codelist scheme"</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">Statisticalsummary</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">Class</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">subClassOf</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">Concept</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Statistical Summary - codelist class"</span>.
<span style="color: #0000ff;">&lt;statisticalSummary/Minimum&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">Concept,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">StatisticalSummary</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #0000ff;">&lt;statisticalSummary&gt;</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">topConceptOf</span> <span style="color: #0000ff;">&lt;statisticalSummary&gt;</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span> <span style="color: #8b2252;">"Minimum"</span>.
<span style="color: #0000ff;">&lt;statisticalSummary/Maximum&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">Concept,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">StatisticalSummary</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #0000ff;">&lt;statisticalSummary&gt;</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">topConceptOf</span> <span style="color: #0000ff;">&lt;statisticalSummary&gt;</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span> <span style="color: #8b2252;">"Maximum"</span>.
<span style="color: #0000ff;">&lt;statisticalSummary/CoefficientOfVariation&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">Concept,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">StatisticalSummary</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #0000ff;">&lt;statisticalSummary&gt;</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">topConceptOf</span> <span style="color: #0000ff;">&lt;statisticalSummary&gt;</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span> <span style="color: #8b2252;">"Coefficient of variation"</span>;
<span style="color: #0000ff;">&lt;statisticalSummary/StandardDeviation&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">Concept,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">StatisticalSummary</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">inScheme</span> <span style="color: #0000ff;">&lt;statisticalSummary&gt;</span>; <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">topConceptOf</span> <span style="color: #0000ff;">&lt;statisticalSummary&gt;</span>;
  <span style="color: #228b22;">skos:</span><span style="color: #008b8b;">prefLabel</span> <span style="color: #8b2252;">"Maximum"</span>.
</pre>
</div>
</div>
</div>
</div>
</div>
