model/README.org
** Devices/Sensors
We defne 4 sensors:
- RTK GPS
- EM38 mk2
- RapidScan CS-45
- SpectroSense 2+

#+BEGIN_SRC Turtle
<sensor/RTK-GPS> a sosa:Sensor; rdfs:label "RTK GPS";
  sosa:observes bdg:position.
<sensor/EM38-mk2> a sosa:Sensor; rdfs:label "EM38 mk2";
  sosa:observes bdg:position, bdg:positionQuality, bdg:satellite, bdg:HDOP, bdg:CV1m, bdg:CV05m.
<sensor/RapidScan-CS-45> a sosa:Sensor; rdfs:label "RapidScan CS-45";
  sosa:observes bdg:position, bdg:HDOP, bdg:hasGpsFix, bdg:NDRE, bdg:NDVI, bdg:RE, bdg:NIR, bdg:RED, bdg:MAXNDRE, bdg:MAXNDV, bdg:MINNDRE, bdg:MINNDVI, bdg:STDNDRE, bdg:STDNDVI, bdg:CVNDRE, bdg:CVNDVI.
<sensor/SpectroSense-2> a sosa:Sensor; rdfs:label "SpectroSense 2+";
  sosa:observes bdg:position, bdg:REDi, bdg:NIRi, bdg:REDr, bdg:NIRr, bdg:RED, bdg:NIR, bdg:NDVI, bdg:LAI.
#+END_SRC

