model/README.html

<div id="outline-container-org8f48586" class="outline-3">
<h3 id="org8f48586"><span class="section-number-3">2.2</span> Devices/Sensors</h3>
<div class="outline-text-3" id="text-2-2">
<p>
We defne 4 sensors:
</p>
<ul class="org-ul">
<li>RTK GPS</li>
<li>EM38 mk2</li>
<li>RapidScan CS-45</li>
<li>SpectroSense 2+</li>
</ul>

<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #0000ff;">&lt;sensor/RTK-GPS&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">Sensor</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"RTK GPS"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">observes</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">position</span>.
<span style="color: #0000ff;">&lt;sensor/EM38-mk2&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">Sensor</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"EM38 mk2"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">observes</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">position,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">positionQuality,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">satellite,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">HDOP,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">CV1m,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">CV05m</span>.
<span style="color: #0000ff;">&lt;sensor/RapidScan-CS-45&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">Sensor</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"RapidScan CS-45"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">observes</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">position,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">HDOP,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">hasGpsFix,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NDRE,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NDVI,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">RE,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NIR,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">RED,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MAXNDRE,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MAXNDV,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MINNDRE,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MINNDVI,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">STDNDRE,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">STDNDVI,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">CVNDRE,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">CVNDVI</span>.
<span style="color: #0000ff;">&lt;sensor/SpectroSense-2&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">Sensor</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"SpectroSense 2+"</span>;
  <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">observes</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">position,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">REDi,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NIRi,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">REDr,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NIRr,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">RED,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NIR,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NDVI,</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">LAI</span>.
</pre>
</div>
</div>
</div>
