model/README.org
** Plots/Geometries
~1. Fasoulis_RTKGPS_Boundaries.xls~
| Estate   | Estate-Segment | Boundary Point |              |               |
|          |                |  Northing (mN) | Easting (mE) | Elevation (m) |
|----------+----------------+----------------+--------------+---------------|
| Fasoulis | geotrhsh       |    4186414.498 |   639833.509 |       297.154 |
| Fasoulis | geotrhsh       |    4186380.300 |   639865.047 |       297.726 |
| Fasoulis | geotrhsh       |    4186404.724 |   639931.511 |       298.354 |
| Fasoulis | geotrhsh       |    4186437.593 |   639900.538 |       297.565 |
| Fasoulis | geotrhsh       |    4186436.262 |   639898.365 |       297.644 |
| Fasoulis | geotrhsh       |    4186444.820 |   639890.154 |       297.424 |
- Estate-Segments are also called Plots
- It's important to use consistent names for them (eg always Geotrisi)

We establish a simple hierarchy of estates and plots.
#+BEGIN_SRC Turtle
bdg:Estate a rdfs:Class; rdfs:subClasssOf geo:Feature, qb4st:RefArea;
  rdfs:label "Estate"; rdfs:comment "Grape producing estate".
bdg:Plot   a rdfs:Class; rdfs:subClasssOf geo:Feature, qb4st:RefArea;
  rdfs:label "Plot";   rdfs:comment "Part of an estate on which measurements are conducted".

<AUA/estate/Fasoulis> a bdg:Estate; rdfs:label "Fasoulis".
<AUA/estate/Fasoulis/Geotrisi> a bdg:Plot; rdfs:label "Fasoulis-Geotrisi";
  geo:sfWithin <AUA/estate/Fasoulis>.
#+END_SRC

We represent the geometry using ~geoSPARQL~
- Following [[https://www.w3.org/TR/sdw-bp/#bp-crs][SDW-BP State how coordinate values are encoded]], we specify explicitly the used Coordinate Reference System.
  We assume it's https://epsg.io/32634 in this case, but that needs to be checked.
  In addition to giving the CRS URL in ~geo:asWKT~ (a GeoSPARQL requirement),
  we also give it as a separate property ~qb4st:crs~ so we can filter geometries by CRS
- Please note that we have repeated the last point because GeoSPARQL polygons must be topologically closed.
- The plot boundary is described using a 3D polygon (lat/long/alt).
  We followed https://en.wikipedia.org/wiki/Well-known_text to select the type ~Polygon Z~.
- GraphDB supports such 3D literals and spatial relations (eg ~geo:sfWithin~) work correctly:
  the altitude Z is ignored for such comparison ([[https://jira.ontotext.com/browse/GDB-3142][GDB-3142]]).
#+BEGIN_SRC Turtle
<AUA/estate/Fasoulis/Geotrisi> geo:hasGeometry <AUA/estate/Fasoulis/Geotrisi/geo>.
<AUA/estate/Fasoulis/Geotrisi/geo> a geo:Geometry;
  qb4st:crs crs-epsg:32634;
  geo:asWKT """<http://www.opengis.net/def/crs/EPSG/0/32634>
     Polygon Z ((
       4186414.498 639833.509 297.154,
       4186380.300 639865.047 297.726,
       4186404.724 639931.511 298.354,
       4186437.593 639900.538 297.565,
       4186436.262 639898.365 297.644,
       4186444.820 639890.154 297.424,
       4186414.498 639833.509 297.154
     ))
  """^^geo:wktLiteral.
#+END_SRC
- TODO: GraphDB does not support alternative CRS in ~geo:asWKT~ ([[https://jira.ontotext.com/browse/GDB-3142][GDB-3142]]) but only in ~geo:asGML~
So we have two options:
- Use ~geo:asGML~, which is a more complex XML-based literal format.
- Convert the geometry to the most commonly used CRS, namely lat/long in CRS84 (https://epsg.io/4326),
  following [[https://www.w3.org/TR/sdw-bp/#bp-crs-choice][SDW-BP Choose the coordinate reference system to suit your user's applications]].
  It is the default in GeoSPARQL, so doesn't need to be specified in the literal.
- There are easily available software libraries to do the conversion,
  though there are no GeoSPARQL functions to expose such conversions
Note: in the example below, I haven't performed an actual conversion, so the coordinates are not correct
#+BEGIN_SRC Turtle
<AUA/estate/Fasoulis/Geotrisi/geo2> a geo:Geometry;
  qb4st:crs crs-ogc:CRS84;
  geo:asWKT """
     Polygon Z ((
       37.414498 22.33509 297.154,
       37.380300 22.65047 297.726,
       37.404724 22.31511 298.354,
       37.437593 22.00538 297.565,
       37.436262 22.98365 297.644,
       37.444820 22.90154 297.424,
       37.414498 22.33509 297.154
     ))
  """^^geo:wktLiteral.
#+END_SRC

