model/README.html

<div id="outline-container-org5447eee" class="outline-3">
<h3 id="org5447eee"><span class="section-number-3">2.3</span> Plots/Geometries</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<code>1. Fasoulis_RTKGPS_Boundaries.xls</code>
</p>
<table border="1" cellspacing="0" cellpadding="2" rules="all" frame="box">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Estate</th>
<th scope="col" class="org-left">Estate-Segment</th>
<th scope="col" class="org-right">Boundary Point</th>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">&#xa0;</th>
</tr>

<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">Northing (mN)</th>
<th scope="col" class="org-right">Easting (mE)</th>
<th scope="col" class="org-right">Elevation (m)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Fasoulis</td>
<td class="org-left">geotrhsh</td>
<td class="org-right">4186414.498</td>
<td class="org-right">639833.509</td>
<td class="org-right">297.154</td>
</tr>

<tr>
<td class="org-left">Fasoulis</td>
<td class="org-left">geotrhsh</td>
<td class="org-right">4186380.300</td>
<td class="org-right">639865.047</td>
<td class="org-right">297.726</td>
</tr>

<tr>
<td class="org-left">Fasoulis</td>
<td class="org-left">geotrhsh</td>
<td class="org-right">4186404.724</td>
<td class="org-right">639931.511</td>
<td class="org-right">298.354</td>
</tr>

<tr>
<td class="org-left">Fasoulis</td>
<td class="org-left">geotrhsh</td>
<td class="org-right">4186437.593</td>
<td class="org-right">639900.538</td>
<td class="org-right">297.565</td>
</tr>

<tr>
<td class="org-left">Fasoulis</td>
<td class="org-left">geotrhsh</td>
<td class="org-right">4186436.262</td>
<td class="org-right">639898.365</td>
<td class="org-right">297.644</td>
</tr>

<tr>
<td class="org-left">Fasoulis</td>
<td class="org-left">geotrhsh</td>
<td class="org-right">4186444.820</td>
<td class="org-right">639890.154</td>
<td class="org-right">297.424</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>Estate-Segments are also called Plots</li>
<li>It's important to use consistent names for them (eg always Geotrisi)</li>
</ul>

<p>
We establish a simple hierarchy of estates and plots.
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">Estate</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">Class</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">subClasssOf</span> <span style="color: #228b22;">geo:</span><span style="color: #008b8b;">Feature,</span> <span style="color: #228b22;">qb4st:</span><span style="color: #008b8b;">RefArea</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Estate"</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Grape producing estate"</span><span style="color: #228b22;">.</span>
<span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">Plot</span>   <span style="color: #a020f0;">a</span> <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">Class</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">subClasssOf</span> <span style="color: #228b22;">geo:</span><span style="color: #008b8b;">Feature,</span> <span style="color: #228b22;">qb4st:</span><span style="color: #008b8b;">RefArea</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Plot"</span>;   <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">comment</span> <span style="color: #8b2252;">"Part of an estate on which measurements are conducted"</span>.

<span style="color: #0000ff;">&lt;AUA/estate/Fasoulis&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">Estate</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Fasoulis"</span>.
<span style="color: #0000ff;">&lt;AUA/estate/Fasoulis/Geotrisi&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">Plot</span>; <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Fasoulis-Geotrisi"</span>;
  <span style="color: #228b22;">geo:</span><span style="color: #008b8b;">sfWithin</span> <span style="color: #0000ff;">&lt;AUA/estate/Fasoulis&gt;</span>.
</pre>
</div>

<p>
We represent the geometry using <code>geoSPARQL</code>
</p>
<ul class="org-ul">
<li>Following <a href="https://www.w3.org/TR/sdw-bp/#bp-crs">SDW-BP State how coordinate values are encoded</a>, we specify explicitly the used Coordinate Reference System.
We assume it's <a href="https://epsg.io/32634">https://epsg.io/32634</a> in this case, but that needs to be checked.
In addition to giving the CRS URL in <code>geo:asWKT</code> (a GeoSPARQL requirement),
we also give it as a separate property <code>qb4st:crs</code> so we can filter geometries by CRS</li>
<li>Please note that we have repeated the last point because GeoSPARQL polygons must be topologically closed.</li>
<li>The plot boundary is described using a 3D polygon (lat/long/alt).
We followed <a href="https://en.wikipedia.org/wiki/Well-known_text">https://en.wikipedia.org/wiki/Well-known_text</a> to select the type <code>Polygon Z</code>.</li>
<li>GraphDB supports such 3D literals and spatial relations (eg <code>geo:sfWithin</code>) work correctly:
the altitude Z is ignored for such comparison (<a href="https://jira.ontotext.com/browse/GDB-3142">GDB-3142</a>).</li>
</ul>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #0000ff;">&lt;AUA/estate/Fasoulis/Geotrisi&gt;</span> <span style="color: #228b22;">geo:</span><span style="color: #008b8b;">hasGeometry</span> <span style="color: #0000ff;">&lt;AUA/estate/Fasoulis/Geotrisi/geo&gt;</span>.
<span style="color: #0000ff;">&lt;AUA/estate/Fasoulis/Geotrisi/geo&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">geo:</span><span style="color: #008b8b;">Geometry</span>;
  <span style="color: #228b22;">qb4st:</span><span style="color: #008b8b;">crs</span> <span style="color: #228b22;">crs-epsg:</span><span style="color: #008b8b;">32634</span>;
  <span style="color: #228b22;">geo:</span><span style="color: #008b8b;">asWKT</span> <span style="color: #8b2252;">""</span><span style="color: #228b22;">"</span><span style="color: #0000ff;">&lt;http://www.opengis.net/def/crs/EPSG/0/32634&gt;</span>
<span style="color: #8b2252;">     Polygon Z ((</span>
<span style="color: #8b2252;">       4186414.498 639833.509 297.154,</span>
<span style="color: #8b2252;">       4186380.300 639865.047 297.726,</span>
<span style="color: #8b2252;">       4186404.724 639931.511 298.354,</span>
<span style="color: #8b2252;">       4186437.593 639900.538 297.565,</span>
<span style="color: #8b2252;">       4186436.262 639898.365 297.644,</span>
<span style="color: #8b2252;">       4186444.820 639890.154 297.424,</span>
<span style="color: #8b2252;">       4186414.498 639833.509 297.154</span>
<span style="color: #8b2252;">     ))</span>
<span style="color: #8b2252;">  ""</span><span style="color: #228b22;">"^^geo:</span><span style="color: #008b8b;">wktLiteral</span>.
</pre>
</div>
<ul class="org-ul">
<li>TODO: GraphDB does not support alternative CRS in <code>geo:asWKT</code> (<a href="https://jira.ontotext.com/browse/GDB-3142">GDB-3142</a>) but only in <code>geo:asGML</code></li>
</ul>
<p>
So we have two options:
</p>
<ul class="org-ul">
<li>Use <code>geo:asGML</code>, which is a more complex XML-based literal format.</li>
<li>Convert the geometry to the most commonly used CRS, namely lat/long in CRS84 (<a href="https://epsg.io/4326">https://epsg.io/4326</a>),
following <a href="https://www.w3.org/TR/sdw-bp/#bp-crs-choice">SDW-BP Choose the coordinate reference system to suit your user's applications</a>.
It is the default in GeoSPARQL, so doesn't need to be specified in the literal.</li>
<li>There are easily available software libraries to do the conversion,
though there are no GeoSPARQL functions to expose such conversions</li>
</ul>
<p>
Note: in the example below, I haven't performed an actual conversion, so the coordinates are not correct
</p>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #0000ff;">&lt;AUA/estate/Fasoulis/Geotrisi/geo2&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">geo:</span><span style="color: #008b8b;">Geometry</span>;
  <span style="color: #228b22;">qb4st:</span><span style="color: #008b8b;">crs</span> <span style="color: #228b22;">crs-ogc:</span><span style="color: #008b8b;">CRS84</span>;
  <span style="color: #228b22;">geo:</span><span style="color: #008b8b;">asWKT</span> <span style="color: #8b2252;">"""</span>
<span style="color: #8b2252;">     Polygon Z ((</span>
<span style="color: #8b2252;">       37.414498 22.33509 297.154,</span>
<span style="color: #8b2252;">       37.380300 22.65047 297.726,</span>
<span style="color: #8b2252;">       37.404724 22.31511 298.354,</span>
<span style="color: #8b2252;">       37.437593 22.00538 297.565,</span>
<span style="color: #8b2252;">       37.436262 22.98365 297.644,</span>
<span style="color: #8b2252;">       37.444820 22.90154 297.424,</span>
<span style="color: #8b2252;">       37.414498 22.33509 297.154</span>
<span style="color: #8b2252;">     ))</span>
<span style="color: #8b2252;">  ""</span><span style="color: #228b22;">"^^geo:</span><span style="color: #008b8b;">wktLiteral</span>.
</pre>
</div>
</div>
</div>
