model/README.org
** Data Structure Definition
We define dataset structures (DSD) per sensor.
- These structures describe the components of each observation, as defined in sec [[*Properties/Variables]]:
  - dimensions: identifying properties of the observation, whcih functionally determine the measures.
    All of these are required
  - attributes: additional qualifiers, including Units of Measure, position quality, etc.
    These are optional by default, unless marked with ~qb:componentRequired true~
  - measures: the values that were observed.
    All of these are required
- ~bdg:plot~ and ~bdg:sensor~ are fixed for each data file, so we attach them to the ~qb:DataSet~
  (No need to use ~qb:Slice~ for this because there's a single fixed value)
- TODO: If wanted, we could also fix the date in this way (but it's implied by ~bdg:dateTime~)
- We use the [[https://www.w3.org/TR/vocab-data-cube/#h4_dsd-mm-obs][Multi-measure observations]] QB pattern:
  "This approach allows multiple observed values to be attached to an individual observation.
  It is suited to representation of things like sensor data and OLAP cubes".
- We fix some attributes to each measure (UoM, featureOfInterest, etc):
  "Attributes can be attached directly to the ~qb:MeasureProperty~ itself
  (e.g. to indicate the unit of measure for that measure)
  but that attachment applies to the whole data set
  (indeed any data set using that measure property)
  and cannot vary for different observations"
- RTK GPS doesn't need a DSD since plot geometries (sec [[*Plots/Geometries]]) are not represented using QB.
#+BEGIN_SRC Turtle
<DSD/EM38-mk2> a qb:DataStructureDefinition;
  qb:component
    [qb:dimension bdg:plot                   ; qb:componentAttachment qb:DataSet],
    [qb:dimension bdg:sensor                 ; qb:componentAttachment qb:DataSet],
    [qb:dimension bdg:position], # including Elevation, which is ignored for comparison
    [qb:dimension bdg:dateTime],
    [qb:attribute bdg:positionQuality],
    [qb:attribute bdg:satellites],
    [qb:attribute bdg:HDOP],
    [qb:attribute sosa:hasFeatureOfInterest  ; qb:componentAttachment qb:MeasureProperty],
    [qb:attribute bdg:measurementContext     ; qb:componentAttachment qb:MeasureProperty],
    [qb:attribute qudt:hasQuantityKind       ; qb:componentAttachment qb:MeasureProperty],
    [qb:attribute sdmx-attribute:unitMeasure ; qb:componentAttachment qb:MeasureProperty],
    [qb:attribute sdmx-attribute:unitMult    ; qb:componentAttachment qb:MeasureProperty],
    [qb:measure   bdg:CV1m],
    [qb:measure   bdg:CV05m].
<DSD/RapidScan-CS-45> a qb:DataStructureDefinition;
  qb:component
    [qb:dimension bdg:plot                   ; qb:componentAttachment qb:DataSet],
    [qb:dimension bdg:sensor                 ; qb:componentAttachment qb:DataSet],
    [qb:dimension bdg:position], # including Elevation, which is ignored for comparison
    [qb:dimension bdg:dateTime],
    [qb:attribute bdg:HDOP],
    [qb:attribute bdg:hasGpsFix],
    [qb:attribute sosa:hasFeatureOfInterest  ; qb:componentAttachment qb:MeasureProperty],
    [qb:attribute qudt:hasQuantityKind       ; qb:componentAttachment qb:MeasureProperty],
    [qb:attribute sdmx-attribute:unitMeasure ; qb:componentAttachment qb:MeasureProperty],
    [qb:measure   bdg:NDRE],
    [qb:measure   bdg:NDVI],
    [qb:measure   bdg:RE],
    [qb:measure   bdg:NIR],
    [qb:measure   bdg:RED],
    [qb:measure   bdg:MAXNDRE],
    [qb:measure   bdg:MAXNDV],
    [qb:measure   bdg:MINNDRE],
    [qb:measure   bdg:MINNDVI],
    [qb:measure   bdg:STDNDRE],
    [qb:measure   bdg:STDNDVI],
    [qb:measure   bdg:CVNDRE],
    [qb:measure   bdg:CVNDVI].
<DSD/SpectroSense-2> a qb:DataStructureDefinition;
  qb:component
    [qb:dimension bdg:plot                   ; qb:componentAttachment qb:DataSet],
    [qb:dimension bdg:sensor                 ; qb:componentAttachment qb:DataSet],
    [qb:dimension bdg:position], # in Northing/Easting, or converted to CRS84 lat/long
    [qb:dimension bdg:dateTime],
    [qb:attribute sosa:hasFeatureOfInterest  ; qb:componentAttachment qb:MeasureProperty],
    [qb:attribute qudt:hasQuantityKind       ; qb:componentAttachment qb:MeasureProperty],
    [qb:attribute sdmx-attribute:unitMeasure ; qb:componentAttachment qb:MeasureProperty],
    [qb:measure   bdg:REDi],
    [qb:measure   bdg:NIRi],
    [qb:measure   bdg:REDr],
    [qb:measure   bdg:NIRr],
    [qb:measure   bdg:RED],
    [qb:measure   bdg:NIR],
    [qb:measure   bdg:NDVI],
    [qb:measure   bdg:LAI].
#+END_SRC
TODO: ~qb4st:SpatioTemporalDSD~

