model/README.html

<div id="outline-container-org5b3d0a4" class="outline-3">
<h3 id="org5b3d0a4"><span class="section-number-3">2.4</span> Data Structure Definition</h3>
<div class="outline-text-3" id="text-2-4">
<p>
We define dataset structures (DSD) per sensor.
</p>
<ul class="org-ul">
<li>These structures describe the components of each observation, as defined in sec <a href="#org56d8018">2.1</a>:
<ul class="org-ul">
<li>dimensions: identifying properties of the observation, whcih functionally determine the measures.
All of these are required</li>
<li>attributes: additional qualifiers, including Units of Measure, position quality, etc.
These are optional by default, unless marked with <code>qb:componentRequired true</code></li>
<li>measures: the values that were observed.
All of these are required</li>
</ul></li>
<li><code>bdg:plot</code> and <code>bdg:sensor</code> are fixed for each data file, so we attach them to the <code>qb:DataSet</code>
(No need to use <code>qb:Slice</code> for this because there's a single fixed value)</li>
<li>TODO: If wanted, we could also fix the date in this way (but it's implied by <code>bdg:dateTime</code>)</li>
<li>We use the <a href="https://www.w3.org/TR/vocab-data-cube/#h4_dsd-mm-obs">Multi-measure observations</a> QB pattern:
"This approach allows multiple observed values to be attached to an individual observation.
It is suited to representation of things like sensor data and OLAP cubes".</li>
<li>We fix some attributes to each measure (UoM, featureOfInterest, etc):
"Attributes can be attached directly to the <code>qb:MeasureProperty</code> itself
(e.g. to indicate the unit of measure for that measure)
but that attachment applies to the whole data set
(indeed any data set using that measure property)
and cannot vary for different observations"</li>
<li>RTK GPS doesn't need a DSD since plot geometries (sec <a href="#org5447eee">2.3</a>) are not represented using QB.</li>
</ul>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #0000ff;">&lt;DSD/EM38-mk2&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">DataStructureDefinition</span>;
  <span style="color: #228b22;">qb:</span>component
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">dimension</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">plot</span>                   ; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span>DataSet],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">dimension</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">sensor</span>                 ; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span>DataSet],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">dimension</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">position],</span> <span style="color: #b22222;"># including Elevation, which is ignored for comparison</span>
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">dimension</span> <span style="color: #228b22;">bdg:</span>dateTime],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">attribute</span> <span style="color: #228b22;">bdg:</span>positionQuality],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">attribute</span> <span style="color: #228b22;">bdg:</span>satellites],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">attribute</span> <span style="color: #228b22;">bdg:</span>HDOP],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">attribute</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  ; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span>MeasureProperty],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">attribute</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">measurementContext</span>     ; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span>MeasureProperty],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">attribute</span> <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       ; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span>MeasureProperty],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">attribute</span> <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> ; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span>MeasureProperty],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">attribute</span> <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMult</span>    ; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span>MeasureProperty],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span>CV1m],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">CV05m]</span>;
<span style="color: #0000ff;">&lt;DSD/RapidScan-CS-45&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">DataStructureDefinition</span>;
  <span style="color: #228b22;">qb:</span>component
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">dimension</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">plot</span>                   ; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span>DataSet],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">dimension</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">sensor</span>                 ; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span>DataSet],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">dimension</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">position],</span> <span style="color: #b22222;"># including Elevation, which is ignored for comparison</span>
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">dimension</span> <span style="color: #228b22;">bdg:</span>dateTime],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">attribute</span> <span style="color: #228b22;">bdg:</span>HDOP],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">attribute</span> <span style="color: #228b22;">bdg:</span>hasGpsFix],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">attribute</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  ; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span>MeasureProperty],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">attribute</span> <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       ; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span>MeasureProperty],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">attribute</span> <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> ; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span>MeasureProperty],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span>NDRE],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span>NDVI],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span>RE],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span>NIR],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span>RED],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span>MAXNDRE],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span>MAXNDV],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span>MINNDRE],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span>MINNDVI],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span>STDNDRE],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span>STDNDVI],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span>CVNDRE],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">CVNDVI]</span>.
<span style="color: #0000ff;">&lt;DSD/SpectroSense-2&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">DataStructureDefinition</span>;
  <span style="color: #228b22;">qb:</span>component
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">dimension</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">plot</span>                   ; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span>DataSet],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">dimension</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">sensor</span>                 ; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span>DataSet],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">dimension</span> <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">position],</span> <span style="color: #b22222;"># in Northing/Easting, or converted to CRS84 lat/long</span>
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">dimension</span> <span style="color: #228b22;">bdg:</span>dateTime],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">attribute</span> <span style="color: #228b22;">sosa:</span><span style="color: #008b8b;">hasFeatureOfInterest</span>  ; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span>MeasureProperty],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">attribute</span> <span style="color: #228b22;">qudt:</span><span style="color: #008b8b;">hasQuantityKind</span>       ; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span>MeasureProperty],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">attribute</span> <span style="color: #228b22;">sdmx-attribute:</span><span style="color: #008b8b;">unitMeasure</span> ; <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">componentAttachment</span> <span style="color: #228b22;">qb:</span>MeasureProperty],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span>REDi],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span>NIRi],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span>REDr],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span>NIRr],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span>RED],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span>NIR],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span>NDVI],
    <span style="color: #228b22;">[qb:</span><span style="color: #008b8b;">measure</span>   <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">LAI]</span>.
</pre>
</div>
<p>
TODO: <code>qb4st:SpatioTemporalDSD</code>
</p>
</div>
</div>
