model/README.org
** Datasets
Now we define 3 datasets that observe the parameters described above, for one plot and one instrument.
- TODO: provide QB4ST spatio-temporal metadata about the dataset (see issue [[https://github.com/w3c/sdw/issues/1110][sdw#1110]])

#+BEGIN_SRC Turtle
<data/tableGrape/Fasoulis/Geotrisi/EM38-mk2> a qb:DataSet;
  rdfs:label "Table grapes data about Fasoulis/Geotrisi from sensor EM38-mk2";
  bdg:sensor <sensor/EM38-mk2>;
  bdg:plot <estate/Fasoulis/Geotrisi>;
  qb:structure <DSD/EM38-mk2>.
<data/tableGrape/Fasoulis/Geotrisi/RapidScan-CS-45> a qb:DataSet;
  rdfs:label "Table grapes data about Fasoulis/Geotrisi from sensor RapidScan CS-45";
  bdg:sensor <sensor/RapidScan-CS-45>;
  bdg:plot <estate/Fasoulis/Geotrisi>;
  qb:structure <DSD/RapidScan-CS-45>.
<data/tableGrape/Fasoulis/Geotrisi/SpectroSense-2> a qb:DataSet;
  rdfs:label "Table grapes data about Fasoulis/Geotrisi from sensor SpectroSense 2+";
  bdg:sensor <sensor/SpectroSense-2>;
  bdg:plot <estate/Fasoulis/Geotrisi>;
  qb:structure <DSD/SpectroSense-2>.
#+END_SRC

- TODO: Should we split the datasets per date?
- TODO: If so, should we represent the date explicitly at the dataset level?
  It's implied by ~bdg:dateTime~ of each observation, but I think we should have it explicit for convenience.
- TODO: Similarly, the estate is not represented explicitly since it's implied by ~bdg:plot~

