model/README.html

<div id="outline-container-org5b08ddb" class="outline-3">
<h3 id="org5b08ddb"><span class="section-number-3">2.5</span> Datasets</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Now we define 3 datasets that observe the parameters described above, for one plot and one instrument.
</p>
<ul class="org-ul">
<li>TODO: provide QB4ST spatio-temporal metadata about the dataset (see issue <a href="https://github.com/w3c/sdw/issues/1110">sdw#1110</a>)</li>
</ul>

<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #0000ff;">&lt;data/tableGrape/Fasoulis/Geotrisi/EM38-mk2&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">DataSet</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Table grapes data about Fasoulis/Geotrisi from sensor EM38-mk2"</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">sensor</span> <span style="color: #0000ff;">&lt;sensor/EM38-mk2&gt;</span>
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">plot</span> <span style="color: #0000ff;">&lt;estate/Fasoulis/Geotrisi&gt;</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">structure</span> <span style="color: #0000ff;">&lt;DSD/EM38-mk2&gt;</span>.
<span style="color: #0000ff;">&lt;data/tableGrape/Fasoulis/Geotrisi/RapidScan-CS-45&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">DataSet</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Table grapes data about Fasoulis/Geotrisi from sensor RapidScan CS-45"</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">sensor</span> <span style="color: #0000ff;">&lt;sensor/RapidScan-CS-45&gt;</span>
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">plot</span> <span style="color: #0000ff;">&lt;estate/Fasoulis/Geotrisi&gt;</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">structure</span> <span style="color: #0000ff;">&lt;DSD/RapidScan-CS-45&gt;</span>.
<span style="color: #0000ff;">&lt;data/tableGrape/Fasoulis/Geotrisi/SpectroSense-2&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">DataSet</span>;
  <span style="color: #228b22;">rdfs:</span><span style="color: #008b8b;">label</span> <span style="color: #8b2252;">"Table grapes data about Fasoulis/Geotrisi from sensor SpectroSense 2+"</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">sensor</span> <span style="color: #0000ff;">&lt;sensor/SpectroSense-2&gt;</span>
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">plot</span> <span style="color: #0000ff;">&lt;estate/Fasoulis/Geotrisi&gt;</span>;
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">structure</span> <span style="color: #0000ff;">&lt;DSD/SpectroSense-2&gt;</span>.
</pre>
</div>

<ul class="org-ul">
<li>TODO: Should we split the datasets per date?</li>
<li>TODO: If so, should we represent the date explicitly at the dataset level?
It's implied by <code>bdg:dateTime</code> of each observation, but I think we should have it explicit for convenience.</li>
<li>TODO: Similarly, the estate is not represented explicitly since it's implied by <code>bdg:plot</code></li>
</ul>
</div>
</div>
