model/README.org
** Observations
Now that we have datasets defined, it's easy to capture all observations.
- Each obseration links to its dataset, whose DSD determines the expected properties
  and the fixed properties (those attached to ~qb:DataSet~ or ~qb:MeasureProperty~)
- Observation URL: we use the dataset URL as prefix, and append the dateTime and a row-number to make the URL unique.
- DateTimes are converted to ~xsd:dateTime~ format

~2. Fasoulis_Geotrisi_EM38.xlsx~
| Longitude | Latitude |    CV1m |  CV05m | Quality | Sat | HDOP | Elevation |     Time | Date       |
|    22.590 |   37.816 | 144.699 | 106.74 |       1 |  12 | 0.69 |   299.612 | 12:26:30 | 23/05/2018 |
#+BEGIN_SRC Turtle
<data/tableGrape/Fasoulis/Geotrisi/EM38-mk2/2018-05-23T12:26:30/1> a qb:Observation;
  qb:dataSet          <data/tableGrape/Fasoulis/Geotrisi/EM38-mk2>;
  bdg:position        "Point Z(22.590 37.816 299.612)"^^geo:wktLiteral;
  bdg:dateTime        "2018-05-23T12:26:30"^^xsd:dateTime;
  bdg:positionQuality <positionQuality-1>;
  bdg:satellites      12;
  bdg:HDOP            0.69;
  bdg:CV1m            144.699;
  bdg:CV05m           106.74.
#+END_SRC

~1. Fasoulis_Geotrisi_RapidScan_230518.xlsx~
| Estate   | Estate-Segment |  NDRE |  NDVI |     RE |    NIR |     R |    LATITUDE |   LONGITUDE | ELEVATION |  HDOP | FIXTYPE       | DATE       |  TIME | MAXNDRE | MAXNDV | MINNDRE |   MINNDVI |  STDNDRE |  STDNDVI | CVNDRE |   CVNDVI |
| Fasoulis | Geotrisi       | 0.274 | 0.817 | 20.099 | 35.383 | 3.512 | ---.------- | ---.------- |       --- |   --- | Fix not valid | 23/05/2018 | 0.446 |   0.367 |  0.897 |   0.127 |     0.492 |  4.65E-2 | 6.759E-2 |  0.169 | 8.260E-2 |
| Fasoulis | Geotrisi       | 0.260 | 0.812 | 20.257 | 34.606 | 3.556 |      37.817 |      22.589 |   -34.799 |   2.9 | GPS           | 23/05/2018 | 0.454 |   0.325 |  0.894 |   0.185 |     0.714 |  2.93E-2 | 3.350E-2 |  0.112 | 4.130E-2 |
| Fasoulis | Geotrisi       | 0.242 | 0.739 | 20.530 | 33.792 | 5.118 |      37.817 |      22.590 |   283.899 | 2.299 | GPS           | 23/05/2018 | 0.457 |   0.352 |  0.865 |  -0.221 | -4.270E-2 | 5.269E-2 |    0.116 |  0.216 |    0.157 |
- *TIME* is rendered in some invalid Excel format. We assume this will be fixed before conversion
- Please note that the first observation here is invalid since it doesn't have GPS fix, nor position.
  It violates QB integrity constraints, which say that each dimension is mandatory.
- The second observation is also de-facto invalid,
  because the negative Elevation shows the sensor has not yet made a reliable satellite connection.
  This cannot be expressed in QB: TODO: define RDF Shapes to validate that case.
#+BEGIN_SRC Turtle
<data/tableGrape/Fasoulis/Geotrisi/RapidScan-CS-45/2018-05-23T12:04:46/1> a qb:Observation;
  qb:dataSet    <data/tableGrape/Fasoulis/Geotrisi/RapidScan-CS-45>;
  bdg:dateTime  "2018-05-23T12:04:46"^^xsd:dateTime;
# bdg:position  "Point Z(---.------- ---.------- ---)"^^geo:wktLiteral; # this invalid literal must not be formed!
# bdg:HDOP      ---;                                                    # this invalid literal must not be formed!
# bdg:hasGpsFix false;                                                  # thus the observation is invalid
  bdg:NDRE      0.274;
  bdg:NDVI      0.817;
  bdg:RE        20.099;
  bdg:NIR       35.383;
  bdg:RED       3.512;
  bdg:MAXNDRE   0.367;
  bdg:MAXNDV    0.897;
  bdg:MINNDRE   0.127;
  bdg:MINNDVI   0.492;
  bdg:STDNDRE   4.65E-2;
  bdg:STDNDVI   6.759E-2;
  bdg:CVNDRE    0.169;
  bdg:CVNDVI    8.260E-2.
<data/tableGrape/Fasoulis/Geotrisi/RapidScan-CS-45/2018-05-23T12:04:54/2> a qb:Observation;
  qb:dataSet    <data/tableGrape/Fasoulis/Geotrisi/RapidScan-CS-45>;
  bdg:dateTime  "2018-05-23T12:04:54"^^xsd:dateTime;
  bdg:position  "Point Z(37.817 22.589 -34.799)"^^geo:wktLiteral; # negative Latitude indicates invalid observation
  bdg:HDOP      2.9;
  bdg:hasGpsFix true;
  bdg:NDRE      0.260;
  bdg:NDVI      0.812;
  bdg:RE        20.257;
  bdg:NIR       34.606;
  bdg:RED       3.556;
  bdg:MAXNDRE   0.325;
  bdg:MAXNDV    0.894;
  bdg:MINNDRE   0.185;
  bdg:MINNDVI   0.714;
  bdg:STDNDRE   2.93E-2;
  bdg:STDNDVI   3.350E-2;
  bdg:CVNDRE    0.112;
  bdg:CVNDVI    4.130E-2.
<data/tableGrape/Fasoulis/Geotrisi/RapidScan-CS-45/2018-05-23T12:04:57/3> a qb:Observation;
  qb:dataSet    <data/tableGrape/Fasoulis/Geotrisi/RapidScan-CS-45>;
  bdg:dateTime  "2018-05-23T12:04:57"^^xsd:dateTime;
  bdg:position  "Point Z(37.817 22.590 283.899)"^^geo:wktLiteral; # valid observation
  bdg:HDOP      2.299;
  bdg:hasGpsFix true;
  bdg:NDRE      0.242;
  bdg:NDVI      0.739;
  bdg:RE        20.530;
  bdg:NIR       33.792;
  bdg:RED       5.118;
  bdg:MAXNDRE   0.352;
  bdg:MAXNDV    0.865;
  bdg:MINNDRE   -0.221;
  bdg:MINNDVI   -4.270E-2;
  bdg:STDNDRE   5.269E-2;
  bdg:STDNDVI   0.116;
  bdg:CVNDRE    0.216;
  bdg:CVNDVI    0.157.
#+END_SRC

~2. Fasoulis_Geotrisi_SpectroSense_230518.xlsx~
| Northing | Easting |  Time |  Date |  REDi |   NIRi |  REDr |  NIRr |      RED |      NIR |  NDVI |   LAI |
|   37.816 |  22.590 | 0.464 | 0.962 | 66.34 | 59.638 | 1.778 | 5.401 | 2.681E-2 | 9.057E-2 | 0.543 | 0.427 |
- Here both date and time are represented in some invalid Excel format and need to be fixed prior to conversion
#+BEGIN_SRC Turtle
<data/tableGrape/Fasoulis/Geotrisi/SpectroSense-2/2018-05-23T12:04:57/1> a qb:Observation;
  qb:dataSet    <data/tableGrape/Fasoulis/Geotrisi/SpectroSense-2>;
  bdg:dateTime  "2018-05-23T12:04:57"^^xsd:dateTime;
  bdg:position  """<http://www.opengis.net/def/crs/EPSG/0/32634>
                   Point(37.816 22.590)"""^^geo:wktLiteral; # TODO: non-default CRS not supported by GraphDB in WKT
  bdg:REDi      66.34;
  bdg:NIRi      59.638;
  bdg:REDr      1.778;
  bdg:NIRr      5.401;
  bdg:RED       2.681E-2;
  bdg:NIR       9.057E-2;
  bdg:NDVI      0.543;
  bdg:LAI       0.427.
#+END_SRC

