model/README.html

<div id="outline-container-orgf2a4b28" class="outline-3">
<h3 id="orgf2a4b28"><span class="section-number-3">2.6</span> Observations</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Now that we have datasets defined, it's easy to capture all observations.
</p>
<ul class="org-ul">
<li>Each obseration links to its dataset, whose DSD determines the expected properties
and the fixed properties (those attached to <code>qb:DataSet</code> or <code>qb:MeasureProperty</code>)</li>
<li>Observation URL: we use the dataset URL as prefix, and append the dateTime and a row-number to make the URL unique.</li>
<li>DateTimes are converted to <code>xsd:dateTime</code> format</li>
</ul>

<p>
<code>2. Fasoulis_Geotrisi_EM38.xlsx</code>
</p>
<table border="1" cellspacing="0" cellpadding="2" rules="all" frame="box">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-right">Longitude</td>
<td class="org-right">Latitude</td>
<td class="org-right">CV1m</td>
<td class="org-right">CV05m</td>
<td class="org-right">Quality</td>
<td class="org-right">Sat</td>
<td class="org-right">HDOP</td>
<td class="org-right">Elevation</td>
<td class="org-right">Time</td>
<td class="org-left">Date</td>
</tr>

<tr>
<td class="org-right">22.590</td>
<td class="org-right">37.816</td>
<td class="org-right">144.699</td>
<td class="org-right">106.74</td>
<td class="org-right">1</td>
<td class="org-right">12</td>
<td class="org-right">0.69</td>
<td class="org-right">299.612</td>
<td class="org-right">12:26:30</td>
<td class="org-left">23/05/2018</td>
</tr>
</tbody>
</table>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #0000ff;">&lt;data/tableGrape/Fasoulis/Geotrisi/EM38-mk2/2018-05-23T12:26:30/1&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span>Observation
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">dataSet</span>          <span style="color: #0000ff;">&lt;data/tableGrape/Fasoulis/Geotrisi/EM38-mk2&gt;</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">position</span>        <span style="color: #8b2252;">"Point Z(22.590 37.816 299.612)"</span><span style="color: #228b22;">^^geo:</span><span style="color: #008b8b;">wktLiteral</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">dateTime</span>        <span style="color: #8b2252;">"2018-05-23T12:26:30"</span><span style="color: #008b8b;">^^xsd:dateTime</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">positionQuality</span> <span style="color: #0000ff;">&lt;positionQuality-1&gt;</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">satellites</span>      12;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">HDOP</span>            0.69;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">CV1m</span>            144.699;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">CV05m</span>           106.74.
</pre>
</div>

<p>
<code>1. Fasoulis_Geotrisi_RapidScan_230518.xlsx</code>
</p>
<table border="1" cellspacing="0" cellpadding="2" rules="all" frame="box">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Estate</td>
<td class="org-left">Estate-Segment</td>
<td class="org-right">NDRE</td>
<td class="org-right">NDVI</td>
<td class="org-right">RE</td>
<td class="org-right">NIR</td>
<td class="org-right">R</td>
<td class="org-right">LATITUDE</td>
<td class="org-right">LONGITUDE</td>
<td class="org-right">ELEVATION</td>
<td class="org-right">HDOP</td>
<td class="org-left">FIXTYPE</td>
<td class="org-left">DATE</td>
<td class="org-right">TIME</td>
<td class="org-right">MAXNDRE</td>
<td class="org-right">MAXNDV</td>
<td class="org-right">MINNDRE</td>
<td class="org-right">MINNDVI</td>
<td class="org-right">STDNDRE</td>
<td class="org-right">STDNDVI</td>
<td class="org-right">CVNDRE</td>
<td class="org-right">CVNDVI</td>
</tr>

<tr>
<td class="org-left">Fasoulis</td>
<td class="org-left">Geotrisi</td>
<td class="org-right">0.274</td>
<td class="org-right">0.817</td>
<td class="org-right">20.099</td>
<td class="org-right">35.383</td>
<td class="org-right">3.512</td>
<td class="org-right">&#x2014;.-------</td>
<td class="org-right">&#x2014;.-------</td>
<td class="org-right">---</td>
<td class="org-right">---</td>
<td class="org-left">Fix not valid</td>
<td class="org-left">23/05/2018</td>
<td class="org-right">0.446</td>
<td class="org-right">0.367</td>
<td class="org-right">0.897</td>
<td class="org-right">0.127</td>
<td class="org-right">0.492</td>
<td class="org-right">4.65E-2</td>
<td class="org-right">6.759E-2</td>
<td class="org-right">0.169</td>
<td class="org-right">8.260E-2</td>
</tr>

<tr>
<td class="org-left">Fasoulis</td>
<td class="org-left">Geotrisi</td>
<td class="org-right">0.260</td>
<td class="org-right">0.812</td>
<td class="org-right">20.257</td>
<td class="org-right">34.606</td>
<td class="org-right">3.556</td>
<td class="org-right">37.817</td>
<td class="org-right">22.589</td>
<td class="org-right">-34.799</td>
<td class="org-right">2.9</td>
<td class="org-left">GPS</td>
<td class="org-left">23/05/2018</td>
<td class="org-right">0.454</td>
<td class="org-right">0.325</td>
<td class="org-right">0.894</td>
<td class="org-right">0.185</td>
<td class="org-right">0.714</td>
<td class="org-right">2.93E-2</td>
<td class="org-right">3.350E-2</td>
<td class="org-right">0.112</td>
<td class="org-right">4.130E-2</td>
</tr>

<tr>
<td class="org-left">Fasoulis</td>
<td class="org-left">Geotrisi</td>
<td class="org-right">0.242</td>
<td class="org-right">0.739</td>
<td class="org-right">20.530</td>
<td class="org-right">33.792</td>
<td class="org-right">5.118</td>
<td class="org-right">37.817</td>
<td class="org-right">22.590</td>
<td class="org-right">283.899</td>
<td class="org-right">2.299</td>
<td class="org-left">GPS</td>
<td class="org-left">23/05/2018</td>
<td class="org-right">0.457</td>
<td class="org-right">0.352</td>
<td class="org-right">0.865</td>
<td class="org-right">-0.221</td>
<td class="org-right">-4.270E-2</td>
<td class="org-right">5.269E-2</td>
<td class="org-right">0.116</td>
<td class="org-right">0.216</td>
<td class="org-right">0.157</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li><b>TIME</b> is rendered in some invalid Excel format. We assume this will be fixed before conversion</li>
<li>Please note that the first observation here is invalid since it doesn't have GPS fix, nor position.
It violates QB integrity constraints, which say that each dimension is mandatory.</li>
<li>The second observation is also de-facto invalid,
because the negative Elevation shows the sensor has not yet made a reliable satellite connection.
This cannot be expressed in QB: TODO: define RDF Shapes to validate that case.</li>
</ul>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #0000ff;">&lt;data/tableGrape/Fasoulis/Geotrisi/RapidScan-CS-45/2018-05-23T12:04:46/1&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span>Observation
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">dataSet</span>    <span style="color: #0000ff;">&lt;data/tableGrape/Fasoulis/Geotrisi/RapidScan-CS-45&gt;</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">dateTime</span>  <span style="color: #8b2252;">"2018-05-23T12:04:46"</span><span style="color: #008b8b;">^^xsd:dateTime</span>;
<span style="color: #b22222;"># bdg:position  "Point Z(---.------- ---.------- ---)"^^geo:wktLiteral; # this invalid literal must not be formed!</span>
<span style="color: #b22222;"># bdg:HDOP      ---;                                                    # this invalid literal must not be formed!</span>
<span style="color: #b22222;"># bdg:hasGpsFix false;                                                  # thus the observation is invalid</span>
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NDRE</span>      0.274;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NDVI</span>      0.817;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">RE</span>        20.099;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NIR</span>       35.383;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">RED</span>       3.512;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MAXNDRE</span>   0.367;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MAXNDV</span>    0.897;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MINNDRE</span>   0.127;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MINNDVI</span>   0.492;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">STDNDRE</span>   4.65E-2;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">STDNDVI</span>   6.759E-2;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">CVNDRE</span>    0.169;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">CVNDVI</span>    <span style="color: #228b22;">8.260E-2.</span>
<span style="color: #0000ff;">&lt;data/tableGrape/Fasoulis/Geotrisi/RapidScan-CS-45/2018-05-23T12:04:54/2&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span>Observation
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">dataSet</span>    <span style="color: #0000ff;">&lt;data/tableGrape/Fasoulis/Geotrisi/RapidScan-CS-45&gt;</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">dateTime</span>  <span style="color: #8b2252;">"2018-05-23T12:04:54"</span><span style="color: #008b8b;">^^xsd:dateTime</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">position</span>  <span style="color: #8b2252;">"Point Z(37.817 22.589 -34.799)"</span><span style="color: #228b22;">^^geo:</span><span style="color: #008b8b;">wktLiteral</span>; <span style="color: #b22222;"># negative Latitude indicates invalid observation</span>
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">HDOP</span>      2.9;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">hasGpsFix</span> true;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NDRE</span>      0.260;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NDVI</span>      0.812;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">RE</span>        20.257;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NIR</span>       34.606;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">RED</span>       3.556;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MAXNDRE</span>   0.325;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MAXNDV</span>    0.894;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MINNDRE</span>   0.185;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MINNDVI</span>   0.714;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">STDNDRE</span>   2.93E-2;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">STDNDVI</span>   3.350E-2;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">CVNDRE</span>    0.112;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">CVNDVI</span>    <span style="color: #228b22;">4.130E-2.</span>
<span style="color: #0000ff;">&lt;data/tableGrape/Fasoulis/Geotrisi/RapidScan-CS-45/2018-05-23T12:04:57/3&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span>Observation
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">dataSet</span>    <span style="color: #0000ff;">&lt;data/tableGrape/Fasoulis/Geotrisi/RapidScan-CS-45&gt;</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">dateTime</span>  <span style="color: #8b2252;">"2018-05-23T12:04:57"</span><span style="color: #008b8b;">^^xsd:dateTime</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">position</span>  <span style="color: #8b2252;">"Point Z(37.817 22.590 283.899)"</span><span style="color: #228b22;">^^geo:</span><span style="color: #008b8b;">wktLiteral</span>; <span style="color: #b22222;"># valid observation</span>
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">HDOP</span>      2.299;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">hasGpsFix</span> true;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NDRE</span>      0.242;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NDVI</span>      0.739;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">RE</span>        20.530;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NIR</span>       33.792;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">RED</span>       5.118;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MAXNDRE</span>   0.352;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MAXNDV</span>    0.865;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MINNDRE</span>   -0.221;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">MINNDVI</span>   -4.270E-2;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">STDNDRE</span>   5.269E-2;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">STDNDVI</span>   0.116;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">CVNDRE</span>    0.216;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">CVNDVI</span>    0.157.
</pre>
</div>

<p>
<code>2. Fasoulis_Geotrisi_SpectroSense_230518.xlsx</code>
</p>
<table border="1" cellspacing="0" cellpadding="2" rules="all" frame="box">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">Northing</td>
<td class="org-right">Easting</td>
<td class="org-right">Time</td>
<td class="org-right">Date</td>
<td class="org-right">REDi</td>
<td class="org-right">NIRi</td>
<td class="org-right">REDr</td>
<td class="org-right">NIRr</td>
<td class="org-right">RED</td>
<td class="org-right">NIR</td>
<td class="org-right">NDVI</td>
<td class="org-right">LAI</td>
</tr>

<tr>
<td class="org-right">37.816</td>
<td class="org-right">22.590</td>
<td class="org-right">0.464</td>
<td class="org-right">0.962</td>
<td class="org-right">66.34</td>
<td class="org-right">59.638</td>
<td class="org-right">1.778</td>
<td class="org-right">5.401</td>
<td class="org-right">2.681E-2</td>
<td class="org-right">9.057E-2</td>
<td class="org-right">0.543</td>
<td class="org-right">0.427</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>Here both date and time are represented in some invalid Excel format and need to be fixed prior to conversion</li>
</ul>
<div class="org-src-container">
<pre class="src src-Turtle"><span style="color: #0000ff;">&lt;data/tableGrape/Fasoulis/Geotrisi/SpectroSense-2/2018-05-23T12:04:57/1&gt;</span> <span style="color: #a020f0;">a</span> <span style="color: #228b22;">qb:</span>Observation
  <span style="color: #228b22;">qb:</span><span style="color: #008b8b;">dataSet</span>    <span style="color: #0000ff;">&lt;data/tableGrape/Fasoulis/Geotrisi/SpectroSense-2&gt;</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">dateTime</span>  <span style="color: #8b2252;">"2018-05-23T12:04:57"</span><span style="color: #008b8b;">^^xsd:dateTime</span>;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">position</span>  <span style="color: #8b2252;">""</span><span style="color: #228b22;">"</span><span style="color: #0000ff;">&lt;http://www.opengis.net/def/crs/EPSG/0/32634&gt;</span><span style="color: #8b2252;"> </span>
<span style="color: #8b2252;">                   Point(37.816 </span><span style="color: #228b22;">22.590)</span><span style="color: #8b2252;">""</span><span style="color: #228b22;">"^^geo:</span><span style="color: #008b8b;">wktLiteral</span>; <span style="color: #b22222;"># </span><span style="color: #228b22;">TODO:</span><span style="color: #008b8b;"> non-default</span><span style="color: #b22222;"> CRS not supported by GraphDB in WKT</span>
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">REDi</span>      66.34;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NIRi</span>      59.638;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">REDr</span>      1.778;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NIRr</span>      5.401;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">RED</span>       2.681E-2;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NIR</span>       9.057E-2;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">NDVI</span>      0.543;
  <span style="color: #228b22;">bdg:</span><span style="color: #008b8b;">LAI</span>       0.427.
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2019-01-03 Thu 00:00</p>
<p class="author">Author: Vladimir Alexiev</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
